[
    {
        "id": "479516143",
        "name": "Minecraft: Dream it, Build it!",
        "url": "https://apps.apple.com/us/app/minecraft-dream-it-build-it/id479516143?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Minecraft: Dream it, Build it!",
                "rating": 1,
                "review": "notch this is stupid there is no copper golems or shelf’s and no copper chains/lanterns/torch /copper bars/nautilus not all of that I’ll give you 1 stars",
                "date": "2025-10-01",
                "value": 80,
                "potential_idea": "Introduce a copper-themed expansion pack including copper golems, shelves, chains, lanterns, torches, bars, and nautilus shells to enhance building and decoration options in the Minecraft-inspired app.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Minecraft: Dream it, Build it!",
                "rating": 1,
                "review": "Minecraft mineCRAP",
                "date": "2025-09-30",
                "value": 60,
                "potential_idea": "Develop a lightweight, optimized mobile version of Minecraft with simplified graphics and controls to appeal to users frustrated with the current app's performance and quality.",
                "tags": []
            },
            {
                "app_name": "Minecraft: Dream it, Build it!",
                "rating": 1,
                "review": "I was playing a server than bam it kicked me out and restarted all my progress and also add in’s in this game tried to flirt with me and I’m a minor",
                "date": "2025-09-30",
                "value": 80,
                "potential_idea": "Introduce enhanced child safety features in multiplayer games, including automatic age verification, flirtation detection in chats, and instant blocking/reporting for inappropriate interactions with minors.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "525818839",
        "name": "Plague Inc.",
        "url": "https://apps.apple.com/us/app/plague-inc/id525818839?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Plague Inc.",
                "rating": 1,
                "review": "Why was France dropping when I literally destroyed its government removed almost all lethality and destroyed the entire European continent I don’t understand why  it was not spreading what kind of game is this",
                "date": "2025-09-30",
                "value": 70,
                "potential_idea": "Introduce an in-game mechanics explainer feature that provides real-time tooltips and post-action summaries to clarify why certain strategies, like government destruction, impact disease spread or country stability in unexpected ways.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Plague Inc.",
                "rating": 1,
                "review": "Tried the shadow and at one point features just stopped working.",
                "date": "2025-09-30",
                "value": 18,
                "potential_idea": "Implement an auto-recovery mechanism for features that fail during use, allowing seamless resumption without loss of progress.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Plague Inc.",
                "rating": 1,
                "review": "Well, all my speed runs are still have a good score, they are no longer at global scoreboard.",
                "date": "2025-09-20",
                "value": 18,
                "potential_idea": "Implement an automated leaderboard refresh mechanism to ensure high-scoring speed runs are promptly added to the global scoreboard, addressing visibility issues for competitive users.",
                "tags": [
                    "bug"
                ]
            }
        ]
    }
]