[
    {
        "id": "479516143",
        "name": "Minecraft: Dream it, Build it!",
        "url": "https://apps.apple.com/us/app/minecraft-dream-it-build-it/id479516143?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Minecraft: Dream it, Build it!",
                "rating": 1,
                "review": "notch this is stupid there is no copper golems or shelf’s and no copper chains/lanterns/torch /copper bars/nautilus not all of that I’ll give you 1 stars",
                "date": "2025-10-01",
                "value": 80,
                "potential_idea": "Introduce a copper-themed expansion pack including copper golems, shelves, chains, lanterns, torches, bars, and nautilus shells to enhance building and decoration options in the Minecraft-inspired app.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Minecraft: Dream it, Build it!",
                "rating": 1,
                "review": "Minecraft mineCRAP",
                "date": "2025-09-30",
                "value": 60,
                "potential_idea": "Develop a lightweight, optimized mobile version of Minecraft with simplified graphics and controls to appeal to users frustrated with the current app's performance and quality.",
                "tags": []
            },
            {
                "app_name": "Minecraft: Dream it, Build it!",
                "rating": 1,
                "review": "I was playing a server than bam it kicked me out and restarted all my progress and also add in’s in this game tried to flirt with me and I’m a minor",
                "date": "2025-09-30",
                "value": 80,
                "potential_idea": "Introduce enhanced child safety features in multiplayer games, including automatic age verification, flirtation detection in chats, and instant blocking/reporting for inappropriate interactions with minors.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "525818839",
        "name": "Plague Inc.",
        "url": "https://apps.apple.com/us/app/plague-inc/id525818839?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Plague Inc.",
                "rating": 1,
                "review": "Why was France dropping when I literally destroyed its government removed almost all lethality and destroyed the entire European continent I don’t understand why  it was not spreading what kind of game is this",
                "date": "2025-09-30",
                "value": 70,
                "potential_idea": "Introduce an in-game mechanics explainer feature that provides real-time tooltips and post-action summaries to clarify why certain strategies, like government destruction, impact disease spread or country stability in unexpected ways.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Plague Inc.",
                "rating": 1,
                "review": "Tried the shadow and at one point features just stopped working.",
                "date": "2025-09-30",
                "value": 18,
                "potential_idea": "Implement an auto-recovery mechanism for features that fail during use, allowing seamless resumption without loss of progress.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Plague Inc.",
                "rating": 1,
                "review": "Well, all my speed runs are still have a good score, they are no longer at global scoreboard.",
                "date": "2025-09-20",
                "value": 18,
                "potential_idea": "Implement an automated leaderboard refresh mechanism to ensure high-scoring speed runs are promptly added to the global scoreboard, addressing visibility issues for competitive users.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "1596736236",
        "name": "Red's First Flight",
        "url": "https://apps.apple.com/us/app/reds-first-flight/id1596736236?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Red's First Flight",
                "rating": 1,
                "review": "if you click on the privacy policy it will list about something I don't know 50 different companies they sell your ads to. It gives you the apparent option to opt out of all of them but when you click it nothing happens. I'll be damned if you're gonna sell my info. Deleted the app.",
                "date": "2025-09-30",
                "value": 0,
                "potential_idea": "Analysis failed.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Red's First Flight",
                "rating": 1,
                "review": "Don’t agree with them removing levels. They should all be available to play.",
                "date": "2025-09-16",
                "value": 77,
                "potential_idea": "Add a 'legacy levels' mode that unlocks all previously removed game levels for users to replay at any time.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Red's First Flight",
                "rating": 2,
                "review": "Im not I'm surprised that the game was removed again. The new engine does not convey the atmosphere of the old classics. And new pigs model is terrifying",
                "date": "2025-08-28",
                "value": 75,
                "potential_idea": "Introduce a user toggle to switch between classic and modern graphics engines, allowing players to experience the nostalgic atmosphere of the original game while accessing new features.",
                "tags": [
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "623592465",
        "name": "Heads Up!",
        "url": "https://apps.apple.com/us/app/heads-up/id623592465?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "I purchased extra packs and they never uploaded to my game. I’ve hit restore purchases and it doesn’t show. I’ve tried to buy the pack again but it says already purchased and brings me to my decks… which isn’t there… I’ve deleted the app to clear the cache- nope. I’ve tried reaching out to app developers and get a 404 page not found error. I purchased several packs in the past and then switched to Android so understandly lost those packs.  But now that I’m back to an iPhone my previously purchased and my new ones never show.",
                "date": "2025-09-25",
                "value": 73,
                "potential_idea": "Develop a cross-platform account system that syncs in-app purchases across iOS and Android devices, ensuring seamless restoration regardless of OS switches.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "I love this game, but it does not work for kids. That’s learning to read. I thought it would have pictures of animals. so for me it was a waste of money.",
                "date": "2025-09-23",
                "value": 72,
                "potential_idea": "Develop an educational reading app for kids featuring interactive pictures of animals to teach phonics and vocabulary, tailored for early learners.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "Horrible app, lures many into buying it thinking they’ll be able to play instantly. Turns out you need to purchase endless pricey card decks to get any value. Feel downright cheated.",
                "date": "2025-09-22",
                "value": 85,
                "potential_idea": "Create a card game app that provides a fully functional starter deck for free, enabling instant core gameplay without mandatory in-app purchases to unlock essential value.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "What happened to the bible deck? want to play it with my church",
                "date": "2025-09-21",
                "value": 75,
                "potential_idea": "Reintroduce a Bible-themed deck with enhanced multiplayer features for group play in religious communities, integrating scripture-based cards for educational and fun church gatherings.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "While inside a Disney park, the pack labeled Disney parks is not free as listed in the app. This is false advertising and extremely frustrating. I’ve downloaded the app thrice and restarted my phone as well as location services.",
                "date": "2025-09-13",
                "value": 20,
                "potential_idea": "Develop a location-aware content unlocker that verifies user presence in Disney parks via GPS and automatically grants free access to the Disney parks pack without misleading listings.",
                "tags": []
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "I thought it was a one time purchase for a deck but I just got charged again a month later. I click  on the “App Support” in the Apple Store to try and resolve this/stop the payment and web link is invalid. I even checked under subscriptions and it doesn’t list it as reoccurring.",
                "date": "2025-09-13",
                "value": 70,
                "potential_idea": "Implement an in-app billing dashboard that clearly displays purchase history, distinguishes between one-time and recurring charges with detailed explanations, and provides direct, functional links to manage or cancel subscriptions without relying on external store support.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "when we call out the answer, it doesn’t recognize the correct answer.",
                "date": "2025-09-06",
                "value": 20,
                "potential_idea": "Develop an improved voice recognition feature for quiz apps that enhances accuracy for spoken answers by incorporating accent adaptation and phonetic matching.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "Even if you purchase the app, you barely have any ‘decks’ to play with. Only very specific decks, and only a couple. Game is blocked behind a paywall — and then has way more to buy. I wish I could get a refund",
                "date": "2025-08-30",
                "value": 70,
                "potential_idea": "Create a card game app offering a one-time premium purchase that unlocks a wide variety of customizable decks and full content access, eliminating additional in-app paywalls to ensure complete value from the initial buy.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 2,
                "review": "Bought the app, could not find how to create a custom deck; when I clicked the link for “get help” the page was “404 not found”\n\nUnless this gets fixed, do not buy.",
                "date": "2025-08-28",
                "value": 20,
                "potential_idea": "Implement an interactive in-app tutorial with searchable help sections to guide users on creating custom decks, replacing broken external links.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "While at a Walt Disney World Park, i tried to download the free Disney Parks pack. The app verified my location but wouldn’t let me download the pack. It would try to charge me the cost of the set of packs.",
                "date": "2025-08-28",
                "value": 20,
                "potential_idea": "Add a pre-download eligibility confirmation feature that re-verifies location and pack status to prevent accidental charging prompts for free in-park content.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "Hated this game, very stupid, would make your kids stupid just from playing..🥸",
                "date": "2025-08-27",
                "value": 60,
                "potential_idea": "Create an AI-powered educational app for kids that gamifies learning critical thinking and problem-solving to counter mindless entertainment and boost cognitive development.",
                "tags": []
            },
            {
                "app_name": "Heads Up!",
                "rating": 2,
                "review": "Why don’t they let you buy a single deck? I don’t want to spend $12.99 when I will only use 1/4 decks. So stupid. Also, bring back the Drag Race deck!",
                "date": "2025-08-26",
                "value": 80,
                "potential_idea": "Introduce an à la carte purchasing option for individual decks, allowing users to buy only the ones they need without requiring bundled packs, and reintroduce fan-favorite decks like Drag Race.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "I bought a pack of decks for $13 and it is showing up in my purchases on my iPhone, but none of the content in the pack is showing up in the my decks section.. so I can’t play them. I tried  selecting restore purchases, but that isn’t working either..",
                "date": "2025-08-26",
                "value": 20,
                "potential_idea": "Develop an enhanced automatic sync feature that verifies and immediately unlocks purchased content across devices upon login or purchase confirmation, reducing reliance on manual restore options.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "No free decks??? After paying for the app you have to spend $20+ to play at all?",
                "date": "2025-08-25",
                "value": 75,
                "potential_idea": "Introduce free starter decks that allow users to play basic games immediately after purchasing the app, without requiring additional in-app purchases.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "I like this game a lot when it works, but I’ve recently tried playing it again and it will open to the “hold to forehead” screen and then not work any further.",
                "date": "2025-08-22",
                "value": 15,
                "potential_idea": "Implement an auto-retry or timeout mechanism for the 'hold to forehead' sensor initiation screen to prevent users from getting stuck and improve game accessibility.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "I’m in the paths but can’t get Disney parks to download for Jess than $9.99 even though it’s supposed to be free",
                "date": "2025-08-22",
                "value": 20,
                "potential_idea": "Implement an automatic free content entitlement checker in the app to detect and apply promotional pricing, preventing users from being charged for supposed free downloads like Disney parks content.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "I purchased this on my phone, thinking that my child, who is part of my iCloud Family, would be able to then install it for free on their phone. Turns out the app doesn’t support family sharing, despite that being super common on the App Store. Greedy. Now I’m stuck with an app on my phone I don’t want and we’ll have to pay for it again to put it on my kids phone. I guess we’ll just go with one of the free rip off versions instead of trying to support the original developer of the game.",
                "date": "2025-08-19",
                "value": 75,
                "potential_idea": "Add family sharing support to the app, enabling iCloud Family members to access purchased apps without additional payments.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "What happened to all the decks you can use for free? I just paid for the app to pay for decks??",
                "date": "2025-08-19",
                "value": 75,
                "potential_idea": "Include a curated library of free, high-quality decks accessible to all paid app subscribers to provide immediate value and reduce perceived need for additional in-app purchases.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "Pay for the app only to get access to more game categories where you then have to PAY AGAIN to be able to even play. \nSo when you pay for the app originally you literally get absolutely NO games to play.",
                "date": "2025-08-17",
                "value": 85,
                "potential_idea": "Introduce a one-time premium purchase option that unlocks full access to all game categories and unlimited gameplay without requiring additional in-app payments.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "They removed the Make Your Own Deck feature and now this app is worthless. The decks I’ve bought replay the same 4 or 5 cards over and over again, making it unplayable.",
                "date": "2025-08-14",
                "value": 80,
                "potential_idea": "Reintroduce an enhanced 'Make Your Own Deck' feature with AI-assisted randomization to ensure diverse card selections and prevent repetition in gameplay.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "Get limited number of categories. Have to pay for more which is crazy for a paid app. Then the categories repeat themselves over and over. So you can’t play them multiple times",
                "date": "2025-08-13",
                "value": 75,
                "potential_idea": "Introduce procedurally generated categories in the base paid app to provide unlimited variety without repetition or extra in-app purchases, enhancing replayability for users.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "the app cost $1.99 which comes with limited amount of categories.  you have to buy everything else in app. i want a refund honestly this is a scam.",
                "date": "2025-08-11",
                "value": 75,
                "potential_idea": "Introduce a fully inclusive one-time purchase model for the app that unlocks all categories and features without any additional in-app purchases, providing transparent value from the outset.",
                "tags": []
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "Wants access to microphone and camera and also must pay to get additional decks.",
                "date": "2025-08-10",
                "value": 60,
                "potential_idea": "Create a privacy-centric flashcard app offering unlimited free decks without mandating microphone or camera permissions, only requesting them for optional interactive features.",
                "tags": []
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "Got ride of the Bible deck our families favorite one to play",
                "date": "2025-08-08",
                "value": 45,
                "potential_idea": "Implement a user restoration feature for removed card decks, allowing families to reinstate favorites like the Bible deck through a simple in-app request system.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "Its fine. Kind of ridiculous to charge so much for other themes. Idk if others have issues but iv had issues with trying to start games or switching between the limited themes",
                "date": "2025-08-08",
                "value": 55,
                "potential_idea": "Introduce a bundle of free basic themes and implement a bug-free theme switching feature that prevents interruptions when starting games.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "They don’t share that your purchase only includes 9 lackluster decks, with all other decks being for purchase starting at $12 each. There are plenty of free charades apps that offer the same thing with easier interfaces. The app also annoyingly replays memories from the home page, with no option I can find to mute them. To turn off the videoing feature I had to go my phone settings, because if there are settings within the app, they are ridiculously hard to find.",
                "date": "2025-07-31",
                "value": 70,
                "potential_idea": "Develop an intuitive in-app settings menu that prominently allows users to disable video recording features and mute home page memory replays, addressing hidden options and improving overall user control.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "Such a bad game. Lousy choices of subject, even after buying a ridiculously expensive add on pack. But even if you do what I did and get the packs, the clues/cards it gives you are horrible and super off topic like half the time. AVOID AVOID AVOID.",
                "date": "2025-07-30",
                "value": 85,
                "potential_idea": "Develop a trivia puzzle app with AI-powered clue generation that ensures 100% topic relevance by cross-referencing user-selected subjects in real-time.",
                "tags": []
            },
            {
                "app_name": "Heads Up!",
                "rating": 2,
                "review": "Heads up is fun but it needs some updates like only 60 seconds???\nI think you should be able to get all the decks for free and just pay for the special decks and  needing to have voice and camera on for videos.\nSo if you really want to download it you should be a little bit careful",
                "date": "2025-07-30",
                "value": 75,
                "potential_idea": "Introduce a privacy mode for the Heads Up game that allows gameplay without requiring camera or microphone access, combined with free basic decks and paid premium ones.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "User interface is terrible and the app keeps bricking all black. Requested refund immediately.",
                "date": "2025-07-29",
                "value": 15,
                "potential_idea": "Develop a crash recovery feature that automatically restarts the app from the last safe state and displays a user-friendly error notification instead of a black screen.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "Tried everything even refunding and rebuying the bundle and for whatever reason it refuses to work. Outdated app with no way of customer support other than asking apple for a refund.",
                "date": "2025-07-22",
                "value": 65,
                "potential_idea": "Implement an in-app customer support system with live chat or ticketing to enable direct issue resolution for app functionality problems, reducing reliance on third-party refund processes.",
                "tags": [
                    "no update for long time",
                    "bug"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "Why must I pay for games when I just paid for the app.",
                "date": "2025-07-21",
                "value": 75,
                "potential_idea": "Introduce a premium app version with a one-time purchase that unlocks all in-app games without additional fees, addressing user frustration with surprise purchases.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "I bought this app, thinking it would come in handy, and would be a fun time I didn’t need to think much about. However, upon purchase, I found there were only like three free sets and they were all such bummy themes. All the interesting stuff is locked, and you have to pay more money to own them or sign up for a subscription. Of course, none of this is properly disclosed in advertising. Do not download!\n\n“It is so bad i wanna give you a 0. But that's not possible so i give you a 1.”",
                "date": "2025-07-19",
                "value": 80,
                "potential_idea": "A mobile app with transparent pre-purchase disclosure of free versus paid content, offering a substantial library of engaging free themes to allow users to fully evaluate the app before any additional monetization.",
                "tags": []
            },
            {
                "app_name": "Heads Up!",
                "rating": 1,
                "review": "There should be an option to delete decks. Of all the decks that could be included for free, the content creators decide to put agenda decks in place to push sexuality agendas. ABSOLUTELY RIDICULOUS.",
                "date": "2025-07-01",
                "value": 20,
                "potential_idea": "Add a user-controlled feature to delete or hide unwanted decks, allowing customization and removal of content perceived as agenda-driven.",
                "tags": [
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "294934058",
        "name": "HotSchedules",
        "url": "https://apps.apple.com/us/app/hotschedules/id294934058?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "For sometime now, I will not get any pop-up notifications or text messages when my schedule has been posted, etc. I used to get them. I’ve checked all the settings. Everything is checked properly. I just don’t get notifications anymore.",
                "date": "2025-09-25",
                "value": 18,
                "potential_idea": "Develop a built-in notification diagnostic tool that tests and verifies alert delivery in real-time, addressing reliability issues for schedule updates.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "It’s annoying how as an employee I have to pay for an app for my job",
                "date": "2025-09-16",
                "value": 73,
                "potential_idea": "Create a corporate licensing platform where employers can purchase and distribute free app subscriptions to employees for work-related tools.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 2,
                "review": "I don’t know if it’s just me? But probably like 3 months (I’ve had it for 3 years now) after getting the app my push notifications for the app stopped working completely so I have to solely rely on my email every time I got notifications about work… yes I checked I have them on in my actual phone settings and my app settings I tried turning them off then on again still doesn’t work. Now a couple days ago my email notifications stopped working now too. \n\nPlease fix this hot schedules starting to really get annoying",
                "date": "2025-08-30",
                "value": 15,
                "potential_idea": "Implement an in-app notification diagnostic tool that automatically detects and troubleshoots push and email notification failures, guiding users to quick resolutions.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "My notifications for this app are on but one day my coworkers and I stopped receiving notifications.",
                "date": "2025-08-26",
                "value": 20,
                "potential_idea": "Implement an in-app notification diagnostic tool that automatically detects and resolves delivery issues for users experiencing sudden notification failures.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 2,
                "review": "An ok scheduling app. Major problem is that it redundantly adds appointments to your calendar, as many as 10 to 12 a day and requires lots of calendar maintenance to keep its entries correct.",
                "date": "2025-08-03",
                "value": 20,
                "potential_idea": "Develop a smart duplicate prevention feature that automatically detects and merges redundant calendar entries before adding new appointments.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "I don’t know when this update was but i opened the app the hideous website style of hot schedules, just as glitchy too. the old version we had a few days ago was so much better </3",
                "date": "2025-07-15",
                "value": 73,
                "potential_idea": "Introduce a user toggle to switch between the new and legacy app interfaces, allowing users to revert to the smoother, preferred old design while fixing glitches in the update.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "0 out of 5 -As a business owner, I had high hopes for HotSchedules to streamline our employee scheduling, but it has been a complete letdown. The app’s communication features are abysmal, making it nearly impossible for my team to stay on the same page. It’s far from user-friendly—my employees found the interface confusing and frustrating to navigate, leading to constant issues with scheduling.\n\nWhen we reached out to customer service and tech support for help, the experience was equally disappointing. The support team was unhelpful, and the issues persisted without resolution. After wasting time and energy, we switched to a much more user-friendly scheduling software that actually works for our team. I strongly recommend avoiding HotSchedules—it’s a headache not worth dealing with.",
                "date": "2025-07-01",
                "value": 85,
                "potential_idea": "Create an AI-powered employee scheduling app with integrated real-time team chat and adaptive user interfaces that simplify navigation and auto-suggest resolutions for common scheduling conflicts, addressing communication and usability gaps in existing tools.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "I spent the whatever $2 to download this app, because it was apparently very important to do that in order for me to work.  Not an ideal, or really morally acceptable, time to hit somebody up for money, but that’s your decision.\nFrom that point, I worked for two weeks and no one in management was authorized or able to finish my set-up process, citing a lack of customer support from the app.\nI have since discovered that the job was not the best fit, and if I would have listened to my gut feeling I would’ve avoided that wasted time, but que será.  The simple fact is this app is a way for businesses to pass the buck onto their hourly wage earners, and I will use my last dying breath to urge people to avoid using it.\nPower to the proletariat!",
                "date": "2025-05-22",
                "value": 75,
                "potential_idea": "A free worker verification and job preview app that allows users to assess employer setup processes and support quality before paying for or committing to any work app.",
                "tags": []
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "have had this app for the last 3 yrs per company policy, not once has the app worked regularly. almost everyday in the morning both the paid app and website don’t even load past the login screen; sometimes not even that. what’s the point of making us pay for an app that doesn’t work and still charging the company to use it too.",
                "date": "2025-05-09",
                "value": 20,
                "potential_idea": "Implement an offline caching system for login sessions to allow users to access the app without server dependency during frequent morning loading failures.",
                "tags": [
                    "no update for long time",
                    "valuable opinion",
                    "bug"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "I can’t login or even load anything it just spins for ever.",
                "date": "2025-05-08",
                "value": 20,
                "potential_idea": "Implement a login timeout feature with user-friendly error notifications to prevent infinite loading spinners and guide users on troubleshooting steps.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "doesn’t work when I try to open the app",
                "date": "2025-05-08",
                "value": 20,
                "potential_idea": "Implement an automatic app health check feature that detects and prompts fixes for launch failures before the main interface loads.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "I paid for it n can’t use ur. I want a refund",
                "date": "2025-04-26",
                "value": 20,
                "potential_idea": "Implement an in-app refund request feature for users unable to access paid content, streamlining support without external processes.",
                "tags": []
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "It charged me 7.99. like what?!",
                "date": "2025-03-07",
                "value": 65,
                "potential_idea": "Add a mandatory preview screen showing the exact charge amount and details before confirming any in-app purchase to avoid surprise billing.",
                "tags": []
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "If I paid for this app, I think it should come with the option to ignore ads. I can't open my schedule without having to view company message every single time I get on the app and it's very frustrating",
                "date": "2025-01-12",
                "value": 75,
                "potential_idea": "Introduce an ad-free mode for paid subscribers that allows users to bypass company messages and directly access their schedule without interruptions.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "Everytime there is a company notification it’s continuously pops up every time you click on a different day or refresh that app. SO ANNOYING FIX IT",
                "date": "2025-01-05",
                "value": 18,
                "potential_idea": "Implement a persistent notification dismissal feature that prevents company notifications from reappearing after the user has acknowledged them, even when navigating between days or refreshing the app.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "First of all I had to purchase this app for $1.99, which is absurd because the app doesn’t even work half the time. It buffers at the loading screen. It seems they have tried to “update” this app so many times but, within the day they revert back to the original format. I despise this app and wish my job used a different platform.",
                "date": "2024-12-16",
                "value": 20,
                "potential_idea": "Create a stable, free alternative mobile app for workplace tasks that prevents buffering issues and ensures permanent update implementations without reverting.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "HotSchedules",
                "rating": 1,
                "review": "Its really really hard to believe how a schedule app that you pay for could be soo bad..but thats reality. A scheduling app that constantly has problems loading your schedule even if you are connected to wifi with no problems. The team at Hotschedules refuse to fix these problems that have plagued the app for years. They do not care about their customers or whether they have a functioning app.",
                "date": "2024-12-16",
                "value": 75,
                "potential_idea": "Develop a scheduling app with built-in offline caching and seamless syncing that ensures schedules load reliably even during connectivity issues, addressing chronic loading problems in existing apps.",
                "tags": [
                    "bug",
                    "no update for long time",
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "932747118",
        "name": "Shadowrocket",
        "url": "https://apps.apple.com/us/app/shadowrocket/id932747118?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "此次更新之后，xhttp 协议完全无法使用。\n\n[18:56:57.995] backend vless <1b88bc81-f4e-31d-6ce-950cd4384e3> send vless header\n[18:56:58.291] mux connection <1b88bc81-f4e-31d-6ce-950cd4384e3> close stream <24>\n[18:56:58.291] mux session <1b88bc81-f4e-31d-6ce-950cd4384e3> group count => <0> id <0> did disconnect reason => xhttp h2 session <1b88bc81-f4e-31d-6ce-950cd4384e3> lib_error_code => -536 error => Remote peer returned unexpected data while we expected SETTINGS frame.  Perhaps, peer does not support HTTP/2 properly.",
                "date": "2025-09-30",
                "value": 20,
                "potential_idea": "Implement an automatic protocol fallback mechanism that detects and switches to compatible alternatives when xhttp fails due to HTTP/2 issues.",
                "tags": [
                    "valuable opinion",
                    "bug"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "之前一直用了3年多，一点问题都没有。更新到2.2.71以后完全用不了",
                "date": "2025-09-29",
                "value": 15,
                "potential_idea": "Introduce an automatic rollback option for app updates that detects malfunctioning versions and reverts to the last stable one to prevent complete usability loss.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 2,
                "review": "I use this app for many years,but it don’t work after update yesterday.the same vpn account is works on my android phone.",
                "date": "2025-09-29",
                "value": 15,
                "potential_idea": "Add an automatic post-update VPN connectivity diagnostic tool that compares performance across devices and suggests fixes or rollbacks.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "previous version works ,but the latest version on ios18.6 nNOT! WORK!",
                "date": "2025-09-29",
                "value": 20,
                "potential_idea": "Add an in-app compatibility checker that scans the user's iOS version before updates and suggests alternatives if issues are known.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "The connection issue persists on my 15 pro max, ios 26 after the 2.2.71 update. Fix the problem! we don’t pay for a nonfunctional app!",
                "date": "2025-09-28",
                "value": 20,
                "potential_idea": "Implement an in-app connection diagnostic tool that identifies and suggests fixes for post-update network issues on iOS devices.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "打开后一会就无法连接了，更新了系统也是，希望尽快修复！",
                "date": "2025-09-28",
                "value": 20,
                "potential_idea": "Implement an automatic reconnection feature to maintain stable connectivity after initial app launch, addressing persistent disconnections even post-system updates.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 2,
                "review": "The new design with a huge blue banner on top is terrible, please don’t ever use it again. My eyes hurt.",
                "date": "2025-09-26",
                "value": 70,
                "potential_idea": "Implement user-customizable UI themes, including options to adjust or disable prominent banners, to reduce eye strain and improve visual comfort.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "第一次见到一个App发布了那么多关于更新的测试build之后，正式上架的版本完全不可用！连接后没两分钟就全断，应该是整个网络部分被重构过了，可惜开发和测试水平太业余！团队你们究竟在干什么？存心的吗？",
                "date": "2025-09-26",
                "value": 18,
                "potential_idea": "Implement an automated network stability testing tool integrated into the app's beta release process to simulate prolonged connections and prevent post-update disconnections.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "sb",
                "date": "2025-09-23",
                "value": 15,
                "potential_idea": "Develop a review validation feature to filter out nonsensical or incomplete submissions like 'sb' to improve data quality.",
                "tags": []
            },
            {
                "app_name": "Shadowrocket",
                "rating": 2,
                "review": "Or new list showed and immediately disappear",
                "date": "2025-09-12",
                "value": 20,
                "potential_idea": "Implement a fix to ensure lists remain visible after loading without immediately disappearing, addressing common UI stability issues in list-based apps.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "我觉得产品和用户，至少应该有最基本的相互尊重对吗？\n麻烦给我一个“提交需求，耐心解释需求”然后被所谓“管理”封禁的理由好吗？ 产品需求： 在代理分组设置一个“节点上限”选项（非订阅时的设置） 某位“管理”说是“伪需求”，我回复他“如果按照这个逻辑，订阅时设置节点上限也是伪需求了，为什么要丢弃节点呢”，凭什么被封禁？ 作为消费者，我至少有提建议的权利吧？ 凭什么？？ 这一小撮人到底是要搞什么？",
                "date": "2025-08-21",
                "value": 75,
                "potential_idea": "Implement a customizable 'node limit' option in proxy group settings for non-subscribed users to prevent automatic node discarding and enhance user control over configurations.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "打开不了",
                "date": "2025-08-21",
                "value": 20,
                "potential_idea": "Implement enhanced app launch diagnostics with user-friendly error messages and auto-recovery options to address common startup failures.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 2,
                "review": "为什么ihone 5c不能用啊",
                "date": "2025-08-15",
                "value": 15,
                "potential_idea": "Implement backward compatibility for iPhone 5c and similar older devices to enable app usage on legacy iOS versions.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "need more effort to learn how to diy conf file",
                "date": "2025-08-15",
                "value": 65,
                "potential_idea": "Introduce an in-app visual configuration builder with guided tutorials to simplify DIY config file creation without manual editing.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "I really enjoy using Shadowrocket—it’s an excellent app! It would be fantastic if the developer could release an update that supports M2 macOS. This would make the app even more versatile and useful.",
                "date": "2025-08-14",
                "value": 82,
                "potential_idea": "Develop a macOS version of Shadowrocket with native M2 chip support to enable seamless proxy and VPN functionality on Apple Silicon desktops.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Shadowrocket",
                "rating": 1,
                "review": "For days I complained to the connection support about my connection issues, until they finally suggested testing another software instead of Shadowrocket. Now I feel it’s a shame that a completely free application can stay connected stably through this connection, while in this so-called premium paid software, it doesn’t even return a single ping!",
                "date": "2025-08-09",
                "value": 75,
                "potential_idea": "Integrate an automated connection stability tester in Shadowrocket that compares performance against alternative free protocols and suggests or switches to the most reliable option for seamless VPN usage.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "6502453075",
        "name": "Balatro",
        "url": "https://apps.apple.com/us/app/balatro/id6502453075?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Balatro",
                "rating": 2,
                "review": "Fun game but my progress doesn’t save anymore.  Many players complain of the same issue for over a year now.",
                "date": "2025-09-25",
                "value": 20,
                "potential_idea": "Implement a reliable automatic cloud save feature with offline caching to ensure game progress is preserved across sessions for all users.",
                "tags": [
                    "bug",
                    "no update for long time"
                ]
            },
            {
                "app_name": "Balatro",
                "rating": 1,
                "review": "Ever since the new ios update the game is extremely slow and glitchy. It almost unplayable. Fix your game!",
                "date": "2025-09-22",
                "value": 20,
                "potential_idea": "Optimize the game's performance and fix glitches to ensure smooth compatibility with the latest iOS updates.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Balatro",
                "rating": 1,
                "review": "Runs horrrrrendus",
                "date": "2025-09-18",
                "value": 20,
                "potential_idea": "Introduce automatic performance diagnostics feature to identify and resolve runtime issues in the app.",
                "tags": []
            },
            {
                "app_name": "Balatro",
                "rating": 2,
                "review": "I don’t really understand all the 5 star reviews.   I have masters degrees in math and statistics (which sad;y you almost need in this game to play really well), and even I just couldn’t find FUN at the heart of this game.   I find the graphics muddy and the level of wildcards overkill.   This is a game for people who deal a poker hand and say “Reds are wild, sevens can be converted to face cards unless there are an odd number of sevens on the board, and then they count as Aces…..”.  Not fun for me!!",
                "date": "2025-09-17",
                "value": 70,
                "potential_idea": "Develop a simplified casual mode for the game with streamlined rules, reduced wildcard complexity, and enhanced clearer graphics to appeal to non-expert players seeking straightforward fun.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Balatro",
                "rating": 1,
                "review": "Would be really nice if we could replay tutorial when coming back to game after awhile away.",
                "date": "2025-09-15",
                "value": 75,
                "potential_idea": "Add a user-initiated replay option for the tutorial, triggered after extended periods of inactivity to help returning players refresh on game mechanics.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Balatro",
                "rating": 1,
                "review": "I hope you like gambling because that’s all it is",
                "date": "2025-09-15",
                "value": 75,
                "potential_idea": "Introduce a transparency dashboard in the app that displays real-time probabilities, risk assessments, and historical outcome data to reduce the perceived 'gambling' nature and empower informed user decisions.",
                "tags": []
            },
            {
                "app_name": "Balatro",
                "rating": 1,
                "review": "Bro this game is absolutely insane i cannot stop playing this game this was totally worth the payment i cannot stop tell u right now ur gonna enjoy it",
                "date": "2025-09-07",
                "value": 75,
                "potential_idea": "Introduce a built-in referral system that rewards players with in-game bonuses for successfully inviting friends who also become highly engaged users, capitalizing on the game's addictive appeal to drive viral growth.",
                "tags": []
            }
        ]
    },
    {
        "id": "1406710800",
        "name": "Stardew Valley",
        "url": "https://apps.apple.com/us/app/stardew-valley/id1406710800?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Stardew Valley",
                "rating": 1,
                "review": "Will make you waste countless hours on it and then break your heart by deleting everything you do. There is no way save it other than going to sleep which doesn’t actually save it at all. My brand new iPad died ONCE and I lost more than a year of game play because there is no save option. Losing one or two days is one thing, an entire year in the game?!?! You lost me. It’s almost 2026, a save option shouldn’t need to be suggested. I’m not playing 1970’s pong for a reason.",
                "date": "2025-09-27",
                "value": 20,
                "potential_idea": "Implement an auto-save and cloud backup feature for game progress to prevent loss from device crashes or failures.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Stardew Valley",
                "rating": 1,
                "review": "I can’t see the health bar properly on the iPhone 17 with even having the tool screen shortened. I never had that issue on android.",
                "date": "2025-09-27",
                "value": 20,
                "potential_idea": "Implement adaptive UI scaling for the health bar to ensure full visibility on larger iPhone screens like the iPhone 17, improving cross-platform consistency.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Stardew Valley",
                "rating": 1,
                "review": "I bought this game 3 years ago. But I still waiting for version can play on Mac. I show it can download from Steam for MacOS but i can’t download on AppStore.",
                "date": "2025-09-21",
                "value": 75,
                "potential_idea": "Create a universal app binary for iOS games that automatically enables macOS compatibility upon purchase, allowing seamless cross-Apple device play without needing separate Steam versions.",
                "tags": [
                    "no update for long time",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Stardew Valley",
                "rating": 1,
                "review": "Zero",
                "date": "2025-09-20",
                "value": 20,
                "potential_idea": "Introduce an in-app diagnostic tool to detect and resolve errors causing complete functionality failure or 'zero' outputs.",
                "tags": []
            },
            {
                "app_name": "Stardew Valley",
                "rating": 1,
                "review": "Please enable mouse and keyboard play!!! I’m so sad that I can’t play with my keyboard. I am a pc player and just downloaded SDV on my IPad thinking i could play while I’m on the road. I’m only giving one star to bring attention to this post, I really do love SDV and would give this game 100 out of 5 stars.",
                "date": "2025-09-09",
                "value": 80,
                "potential_idea": "Implement external keyboard and mouse support for iPad users of Stardew Valley to enable PC-like controls on mobile devices, addressing the needs of traveling PC players.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Stardew Valley",
                "rating": 2,
                "review": "Not surprised",
                "date": "2025-09-09",
                "value": 60,
                "potential_idea": "Implement a surprise notification system that highlights unexpected app improvements or hidden features to exceed user expectations and combat resignation.",
                "tags": []
            },
            {
                "app_name": "Stardew Valley",
                "rating": 1,
                "review": "Scam",
                "date": "2025-09-08",
                "value": 15,
                "potential_idea": "Introduce a transparent transaction verification feature to build user trust and counter scam perceptions by providing clear logs of all app activities.",
                "tags": []
            },
            {
                "app_name": "Stardew Valley",
                "rating": 1,
                "review": "The game gives you some options to adjust menu spacing and other UI, but it is extremely limited! No matter what some things get cut off or are extremely awkward on the screen. Love this game but not on mobile. It’s practically unplayable.\n\nNot even able to refund while only playing for a couple minutes! Very upsetting.",
                "date": "2025-09-01",
                "value": 73,
                "potential_idea": "Introduce an advanced adaptive UI engine for mobile games that dynamically resizes and repositions menus and elements based on device screen size, orientation, and user input preferences to ensure seamless playability across all devices.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Stardew Valley",
                "rating": 1,
                "review": "而是它和我最讨厌的游戏联动了。我真的很喜欢星露谷物语，刚开始在iPhone上玩这个游戏，非常喜欢。整天都再玩。之后我又在steam上买了它，开了新的存档。这个游戏一直是我避风的港湾。然而它和曾经网爆过我的游戏联动了。我再也无法直视星露谷物语这个游戏了。每当我打开这个游戏我可能会想到曾经被网爆的时刻。我知道我无法改变这次联动的决定。我只好不再玩这个游戏了。再见。",
                "date": "2025-08-27",
                "value": 80,
                "potential_idea": "A customizable content filter in mobile games that allows users to disable or hide specific collaborations and tie-ins to avoid triggering personal emotional traumas, meeting the demand for mental health personalization while offering a novel opt-out mechanism not commonly available in existing games.",
                "tags": []
            },
            {
                "app_name": "Stardew Valley",
                "rating": 2,
                "review": "As the title says there is barely a tutorial. The first night I couldn’t get into my house so I passed out and then was charged 50 coins bc the medical team had to rescue me. Would have been nice to know ahead of time. Controlling where the avatar moves is clunky. There’s no map, you just wander aimlessly around town and hope for the best. I’m still not sure how to sell things in my inventory. All of this after 30 minutes of play…for 5 dollars?! Lame",
                "date": "2025-08-21",
                "value": 70,
                "potential_idea": "Develop an interactive onboarding tutorial with an in-game map and pop-up guides to teach basic mechanics like home entry, navigation, and inventory selling for new players.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Stardew Valley",
                "rating": 1,
                "review": "Couldn’t move past creating my farmer",
                "date": "2025-08-18",
                "value": 20,
                "potential_idea": "Add automated error detection and recovery prompts during character creation to prevent users from getting stuck and ensure smooth progression.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Stardew Valley",
                "rating": 2,
                "review": "The energy bar and health bar are too low on the screen and not fully visible on iPhone 16 pro max and there’s no way I’ve found to move them. This needs to be fixed it directly hurts gameplay.",
                "date": "2025-08-18",
                "value": 20,
                "potential_idea": "Add a customizable UI feature allowing users to manually reposition health and energy bars for better visibility on larger screens like the iPhone 16 Pro Max.",
                "tags": [
                    "valuable opinion",
                    "bug"
                ]
            },
            {
                "app_name": "Stardew Valley",
                "rating": 1,
                "review": "手机版没有mod游戏体验太差了 做了手柄操作但是完全没有用心，明明可以直接把pc端手柄操作移植过来却非要废除右摇杆功能导致现在手柄几乎是个废物",
                "date": "2025-08-13",
                "value": 78,
                "potential_idea": "Port PC controller configurations, including right analog stick functionality, directly to the mobile version to enable seamless modded gaming experiences with handheld controllers.",
                "tags": [
                    "valuable opinion",
                    "niche demand"
                ]
            },
            {
                "app_name": "Stardew Valley",
                "rating": 1,
                "review": "请作者回复我，为什么我的ipad下载以后，也显示出来了合作那个按钮，但是进去以后只能加入别人的主机，自己不能建主机？",
                "date": "2025-08-13",
                "value": 20,
                "potential_idea": "Enable the ability to create collaboration hosts directly on iPad devices to allow users full functionality across platforms.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "824305459",
        "name": "Papa's Freezeria To Go!",
        "url": "https://apps.apple.com/us/app/papas-freezeria-to-go/id824305459?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 1,
                "review": "I don’t know hth this gone on my phone, but I am being charged and I cannot see how to cancel subscription!",
                "date": "2025-08-29",
                "value": 75,
                "potential_idea": "Implement a prominent, one-tap subscription cancellation feature within the app, including a clear tutorial on managing and removing unwanted app installations and charges.",
                "tags": []
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 2,
                "review": "It’s a knockoff pirate version of the original game, horrible pixelated quality.",
                "date": "2025-08-09",
                "value": 60,
                "potential_idea": "Develop a mobile app scanner that detects and warns users about knockoff or pirated game apps by analyzing quality metrics like pixelation and comparing to official versions.",
                "tags": []
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 2,
                "review": "Hd version shows up better but you can play this for cheaper option",
                "date": "2025-07-12",
                "value": 60,
                "potential_idea": "Introduce a tiered subscription model in the app allowing users to choose between premium HD visuals for enhanced viewing and a budget-friendly low-res option to reduce costs and data usage.",
                "tags": []
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 1,
                "review": "day 1 of asking for my account back😔",
                "date": "2025-06-26",
                "value": 73,
                "potential_idea": "Introduce an AI-driven self-service account recovery tool that uses multi-factor identity verification and automated escalation to support for faster resolution of access issues.",
                "tags": []
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 2,
                "review": "This game was one of my favorites when I was younger, I can’t bring myself to continue playing it though, because the graphics are so bad. This game would be 5/5 if it were more updated like the newer papa’s mobile games. Not worth 99¢.",
                "date": "2025-05-17",
                "value": 80,
                "potential_idea": "Develop a graphics remaster update for the classic Papa's mobile game to align with the visual style of newer titles in the series, enhancing playability for nostalgic users.",
                "tags": [
                    "no update for long time",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 1,
                "review": "I just purchased this game and the gameplay screen is very small and such bad quality! I would like my .99 back, you can keep this game. I’m very disappointed because I love papa games",
                "date": "2025-05-12",
                "value": 20,
                "potential_idea": "Add adaptive screen scaling and enhanced graphics resolution options to the gameplay interface for better visibility and quality on various mobile devices.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 2,
                "review": "this game is absolutely NOTHING like the computer version.. and it doesn’t even let you drag toppings into the right place. what a waste of $1.06 🤦🏽‍♀️",
                "date": "2025-05-02",
                "value": 18,
                "potential_idea": "Implement a precise drag-and-drop interface for topping placement in the mobile version that exactly replicates the computer game's mechanics to ensure parity in user experience.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 1,
                "review": "Quality was terrible and blurry.",
                "date": "2025-04-30",
                "value": 15,
                "potential_idea": "Add an AI-based auto-enhancement feature that detects and sharpens blurry images or videos directly in the app to improve output quality.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 2,
                "review": "I feel like the screen is small and pixelated and it doesn’t even give us enough time to get someone’s order done before another customer arrives, i would be making customer 1s, and Then they keep showing up, its very fast but the drinks take very slow and the speed up button is basically useless, it doesn’t help.",
                "date": "2025-04-07",
                "value": 75,
                "potential_idea": "Implement dynamic pacing controls that allow players to adjust customer arrival rates and drink preparation speeds in real-time, with a more effective speed-up mechanic tied to player upgrades.",
                "tags": [
                    "valuable opinion",
                    "bug"
                ]
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 1,
                "review": "I LITERALLY WORK 7 DAYS A WEEK!!! AND ONLY GOT 107 DOLLARS LIKE WHAT IS MINIMUM WAGE??????? HOW MANY HOURS AM I WORKING?? HOW DO YOU EXPECT ME TO PAY RENT??? BILLS??? HELLLOOO?????",
                "date": "2025-03-26",
                "value": 85,
                "potential_idea": "A gig economy app feature that automatically tracks hours worked, calculates earnings against local minimum wage standards, and provides financial planning tips to help users budget for bills and rent.",
                "tags": []
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 1,
                "review": "This says it works on IPad. It’s a complete lie. I downloaded this game to play it and it does not want to work. The screen flips. Fix your game",
                "date": "2025-03-23",
                "value": 20,
                "potential_idea": "Implement automatic orientation locking and iPad-specific optimizations to ensure seamless gameplay without screen flipping on tablet devices.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 1,
                "review": "The game is trash I hate it",
                "date": "2025-03-08",
                "value": 15,
                "potential_idea": "Introduce an anonymous in-game feedback system allowing users to rate and detail specific aspects of the game they dislike, enabling targeted improvements.",
                "tags": []
            },
            {
                "app_name": "Papa's Freezeria To Go!",
                "rating": 2,
                "review": "It doesn’t work on my end and they won’t give me any refund for it. It just keeps freezing and lagging.",
                "date": "2025-02-21",
                "value": 20,
                "potential_idea": "Introduce an in-app performance diagnostic tool that automatically detects freezing and lagging issues and offers quick fixes or optimization tips to users.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "625334537",
        "name": "Geometry Dash",
        "url": "https://apps.apple.com/us/app/geometry-dash/id625334537?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Geometry Dash",
                "rating": 2,
                "review": "I’ve been playing Geometry Dash for five years and don’t get me wrong I love this game but with the new iOS 26 update on iPhone, it’s lagging the heck out of my session causing me to die over and over again. It’s either apple‘s fault or my iPhone fault because this game is actually so easy to run",
                "date": "2025-09-30",
                "value": 20,
                "potential_idea": "Introduce an automatic performance tuner in Geometry Dash that detects iOS version changes and adjusts game settings to prevent lag on updated devices.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Geometry Dash",
                "rating": 1,
                "review": "I just paid for this game again on my new phone and now its super buggy. Im on ios 26 in a iphone 15 and it was less buggy on my iphone XR!",
                "date": "2025-09-30",
                "value": 20,
                "potential_idea": "Implement automatic device and OS-specific optimizations that detect new iPhone models and iOS versions to deliver seamless, bug-free gameplay without requiring repurchases.",
                "tags": [
                    "bug",
                    "no update for long time"
                ]
            },
            {
                "app_name": "Geometry Dash",
                "rating": 1,
                "review": "Couldn’t even make an account wow this is so bad. She says my email is not a real thing, but it is. I tried to get over a simple jump and I’m not even touching the spike and it killed me. This game is so stupid. Don’t even get me started with the Level editor.",
                "date": "2025-09-30",
                "value": 20,
                "potential_idea": "Implement robust email validation with fallback options and clearer error messages during account creation to reduce onboarding frustrations.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Geometry Dash",
                "rating": 1,
                "review": "ITS LAGGING SO MUCH!!! IPHONE 16 PRO AND LAGGING",
                "date": "2025-09-29",
                "value": 20,
                "potential_idea": "Implement automated performance diagnostics in the app to detect and resolve lagging issues on high-end iOS devices like the iPhone 16 Pro.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Geometry Dash",
                "rating": 1,
                "review": "been playing for 10+ years and now the games so laggy from the update i cant even play 🙁",
                "date": "2025-09-28",
                "value": 15,
                "potential_idea": "Introduce a user-selectable low-performance mode for older devices to mitigate lag after game updates.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Geometry Dash",
                "rating": 1,
                "review": "ROBTOP YOUR LEVElS THE WORST JUST LIKE YOU",
                "date": "2025-09-28",
                "value": 65,
                "potential_idea": "Implement a pre-upload AI-assisted quality review tool for user-generated levels to filter out low-effort or unbalanced content before they go live.",
                "tags": []
            },
            {
                "app_name": "Geometry Dash",
                "rating": 1,
                "review": "i play geometry dash alot, i test games out, i stream, I also develop things in the game itself, its been lagging for as long as i can remember and i havent told my viewers, i am doing this off-stream. but yeah, please fix the errors",
                "date": "2025-09-28",
                "value": 18,
                "potential_idea": "Implement a performance optimization tool in Geometry Dash specifically for level developers and testers to reduce lag during in-game creation and streaming sessions.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Geometry Dash",
                "rating": 2,
                "review": "This game is so good and I really wanna have 2.22! I also have a suggestion: make animation work on mobile because when I try to press ANIM it just puts me back in the main editor. Steps: select an object, tap edit group, tap anim.",
                "date": "2025-09-28",
                "value": 78,
                "potential_idea": "A mobile-optimized animation editor that allows users to create and preview animations directly within the app without being kicked back to the main menu.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Geometry Dash",
                "rating": 1,
                "review": "bad words",
                "date": "2025-09-27",
                "value": 75,
                "potential_idea": "An app feature that uses AI to detect and automatically filter profanity or offensive language from user-generated content before it is posted.",
                "tags": []
            },
            {
                "app_name": "Geometry Dash",
                "rating": 2,
                "review": "Why sometimes when I open the app it just is going 1 fps and sometimes it doesn’t? I’m on an iPhone 16 so it shouldn’t have problems so idk why it’s lagging sooo bad cuz it didn’t used to do this",
                "date": "2025-09-26",
                "value": 65,
                "potential_idea": "An app performance monitoring tool that provides users with real-time diagnostics and simple, actionable fixes for performance issues like lag, crashes, or high battery usage.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "1118115766",
        "name": "Bloons TD 6",
        "url": "https://apps.apple.com/us/app/bloons-td-6/id1118115766?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Bloons TD 6",
                "rating": 1,
                "review": "Was torn whether to give 1 or 5 stars, been playing for 2-3 years and have always thought it was an awesome near-perfect game— easily 5+ stars. Over the past 1-2 months, it has been and still is CONSTANTLY crashing. I submitted a message to support team via ninja kiwi’s website several weeks ago to make them aware if they weren’t already. Before I did that, I had given it plenty of time to resolve after making absolutely sure the softwares for both the game and my iPhone were up-to-date. It’s been a few weeks since submitting that message, and it is STILL crashing. I’ve been trying to get black borders on maps, and in EVERY CHIMPS ATTEMPT I DO ON ANY MAP IT ALWAYS CRASHES, which prevents me from getting the black borders!! EVEN ON THE BASIC HARD DIFFICULTY LEVEL, it crashes WELL BEFORE round 80. Every. Single. Freakin. Game. It is so frustrating and it having been happening for as long as it has, as often as it does, has gotten ridiculous. Please either change the freaking chimps so you can still get the chimps medal with black eyes (and thus black border) when the game crashes, or fix the crashes. \n\nThe game used to only crash when my son and I would play co-op and get into rounds 140+, and that would be infuriating and ridiculous when at least one of us would always be kicked and completely lose access to re-join the game. Now it’s crashing on solo games sometimes before round 60, always before round 80, and it completely messes up the opportunity to get the medals/borders for maps that ninja kiwi designed to be a part of the game! Sorry rant over. Please fix. This is ridic.",
                "date": "2025-10-01",
                "value": 80,
                "potential_idea": "An automatic crash-recovery system for challenge modes that saves progress at key intervals and allows players to re-enter a game from the last saved point after a crash, preserving their chance to earn completion medals.",
                "tags": [
                    "no update for long time",
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Bloons TD 6",
                "rating": 1,
                "review": "It’s like my 10th time playing and some reason it’s taking forever to load. PLEASE FIX THIS!",
                "date": "2025-09-30",
                "value": 60,
                "potential_idea": "An app feature that provides a visual loading progress indicator with an estimated wait time and optional offline mini-games to play during long load screens.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Bloons TD 6",
                "rating": 1,
                "review": "Six dollars and when I download the game, I can’t even play yet. I have to go through hours of unlocking stuff if you’re gonna do that at least tell people before they download the game that they’re not actually buying the game. They actually have to spend multiple hours and even a day to actually play at four capacity and even then you have to pay for almost everything else please make it so we don’t have to get tower XP at least for the base to the paragons make sense",
                "date": "2025-09-24",
                "value": 70,
                "potential_idea": "An app or platform that provides clear, upfront 'playability scores' for games, detailing the time and financial investment required to access core content after purchase.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Bloons TD 6",
                "rating": 1,
                "review": "This game has fallen off so hard no good updates all just more updates to try to take money and the only way to make monkey money is playing the same map over and over again just to need 30k more monkey money when you make 30 every 40 waves 🫩",
                "date": "2025-09-24",
                "value": 75,
                "potential_idea": "A 'Monkey Money Daily Challenge' system that offers varied, short-form gameplay modes with larger, guaranteed currency rewards to break the repetitive grinding cycle.",
                "tags": [
                    "no update for long time",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Bloons TD 6",
                "rating": 1,
                "review": "Legends now crashes near the end of any level. It’s beyond frustrating, since I spend 20 minutes getting through a difficult level only to have the game crash and then when I reload it counts as a LOSS! At the very least I shouldn’t lose because your game code wasn’t tested on iOS.  Please fix Legends. It cost extra beyond just the game itself!!!!!!",
                "date": "2025-09-23",
                "value": 85,
                "potential_idea": "An app-level crash recovery system that automatically saves progress mid-level and restores it after a crash, preventing loss of progress and unfair penalties.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Bloons TD 6",
                "rating": 2,
                "review": "Game is super addicting, however I can’t get past round 153 without it crashing my game, crashes all the time at high rounds on mobile, I have a IPhone 13 and it can’t handle this game on high rounds. Once that’s fixed, easy 5 stars.",
                "date": "2025-09-23",
                "value": 80,
                "potential_idea": "An adaptive performance mode that automatically reduces graphical fidelity and background processes during high-intensity gameplay to prevent crashes on mobile devices.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Bloons TD 6",
                "rating": 2,
                "review": "The game is amazing but it instantly banned me when I made an account and I don’t have hacks or anything",
                "date": "2025-09-20",
                "value": 65,
                "potential_idea": "An automated appeal system that allows users to dispute accidental bans directly within the app with a one-touch 'Appeal' button and instant ticket submission.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Bloons TD 6",
                "rating": 2,
                "review": "When too many micro transactions for a 7 dollar game. Disgusting. Pay to win. Pathetic monetization.",
                "date": "2025-09-19",
                "value": 65,
                "potential_idea": "A mobile game monetization dashboard that provides players with clear, upfront transparency on all in-game purchases, categorizing them as cosmetic, pay-to-win, or convenience-based before they download.",
                "tags": []
            },
            {
                "app_name": "Bloons TD 6",
                "rating": 1,
                "review": "I loaded up balloons after updating the iOS 26 and now it just black screens and crashes.",
                "date": "2025-09-17",
                "value": 15,
                "potential_idea": "An app compatibility pre-check tool that scans a user's device and iOS version before an update to warn them of potential app crashes.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Bloons TD 6",
                "rating": 1,
                "review": "I’ve been playing this game about a week and the game keeps telling me I am not connected and I sit on the screen that says it’s trying to reconnect for 5-10 minutes until I finally just back out. This especially happens when I play co-op mode. Very unhappy. I enjoy the app but don’t appreciate wasting my insta monkeys when I can’t even finish the game.",
                "date": "2025-09-13",
                "value": 78,
                "potential_idea": "An offline co-op mode that allows players to continue their game session locally when a connection is lost, with progress syncing once reconnected.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Bloons TD 6",
                "rating": 1,
                "review": "Monkey",
                "date": "2025-09-13",
                "value": 15,
                "potential_idea": "An app that uses AI to analyze vague user feedback (like single words or emojis) and automatically prompts for more detailed, structured feedback to help developers.",
                "tags": []
            }
        ]
    },
    {
        "id": "373493387",
        "name": "AnkiMobile Flashcards",
        "url": "https://apps.apple.com/us/app/ankimobile-flashcards/id373493387?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "Everything on iOS is worse",
                "date": "2025-09-26",
                "value": 35,
                "potential_idea": "An app that provides a curated, side-by-side comparison of iOS and Android feature implementations to help users understand platform-specific limitations and advantages.",
                "tags": []
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "It’s been over a year since iOS introduced dark mode icons, and Anki still doesn’t have support for a dark mode icon. I’ll change my review to 5 stars once it does!",
                "date": "2025-09-18",
                "value": 78,
                "potential_idea": "An app feature that automatically adapts the app icon to the system-wide dark/light mode theme.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "So difficult to accomplish what works best for me within the app. I’m starting to build out my deck of flashcards on different topics, but I can’t see new cards created bc I’ve reached my daily new card limit. I’ve tried increasing it or doing a customer study plan and it won’t work. DO NOT spend the money for this app. Appears to be customizable but it is really not.",
                "date": "2025-09-03",
                "value": 85,
                "potential_idea": "An app that allows users to create and study custom flashcard decks with truly flexible, user-controlled daily limits and study plans.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "It’s super complicated. Waste of time and money.",
                "date": "2025-08-31",
                "value": 68,
                "potential_idea": "An app that provides a simplified, guided tutorial mode for complex applications, breaking down features into manageable, step-by-step lessons.",
                "tags": []
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "I have tried thousand times to sunc put in oassword again and again it says wrong password or email!!! What is this anki???",
                "date": "2025-08-26",
                "value": 68,
                "potential_idea": "An account recovery system that uses alternative verification methods (like a one-time code sent via SMS or email) for users who are certain they are entering their correct credentials but are repeatedly locked out.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "This app is complete garbage on iPhone. I can’t download any decks directly from Anki to my app on iPhone. I’ve tried using my computer to use the desktop site then synchronizing from there and still nothing. A complete waste of time and money",
                "date": "2025-08-17",
                "value": 70,
                "potential_idea": "A feature that allows direct, seamless import of Anki decks from the web or a user's files into the mobile app, bypassing the need for desktop synchronization.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "Why did you bring this update man why ? It just ruined my study and life . Please downgrade the basic image occlusion part . Please please please",
                "date": "2025-07-26",
                "value": 68,
                "potential_idea": "A version history or 'rollback' feature that allows users to easily revert a specific tool (like image occlusion) to a previous, preferred version without downgrading the entire app.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "This app is terrible. Completely messed up my card deck. Date intervals are all messed up. App is not worth using especially for how much it is. If I could, I would give it 0 stars.",
                "date": "2025-07-13",
                "value": 15,
                "potential_idea": "Implement a robust card deck and date interval management system with data integrity checks to prevent corruption.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "Horrible",
                "date": "2025-07-11",
                "value": 15,
                "potential_idea": "A highly polished and stable version of the app with significant bug fixes and performance improvements.",
                "tags": []
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "I paid for this without first being informed that I would need to have a computer in order to use it. I have watched so many videos trying to figure out a way around this and I can’t understand what I’m supposed to do so I am just deleting the app. Please provide a refund as I feel that I shouldn’t have to pay for something that I’m not even going to use.",
                "date": "2025-06-17",
                "value": 50,
                "potential_idea": "Develop a mobile-first version of the app or clearly state mobile compatibility requirements upfront.",
                "tags": []
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 2,
                "review": "For a 25$ app it should not have this much trouble synching images",
                "date": "2025-06-16",
                "value": 15,
                "potential_idea": "Implement robust and reliable cloud synchronization for app images to prevent data loss and ensure seamless access across devices, especially for paid applications.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "i did literally everything to sync my decks from my laptop to the app and nothing worked. now all my money is down the drain for the crime of wanting to learn. you’re better off using noji, the app and website syncs automatically if you are signed in.",
                "date": "2025-06-04",
                "value": 75,
                "potential_idea": "Implement reliable and automatic cloud synchronization between the mobile app and its web/desktop counterpart to ensure data consistency and prevent user frustration.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 2,
                "review": "This app feels frustrating to navigate and a waste of money. Why are the free Anki imitations easier to use? It’s no wonder why the knockoffs are more popular when this app costs $25 and looks like it hasn’t been updated in over a decade, and the free versions offer better features. For example, when viewing all cards in a deck, the only option is to browse by the front of the cards only. Very tiresome when needing to sort through cards for language learning purposes when it doesn’t show you the translation as well. Why can’t this app display the cards’ front and backs simultaneously?\n\nSecond, do the creators know that the free versions of this app automatically translate words into your desired language when you put them in new cards? For $25, why can’t this app do the same?\n\nThis app does not seem relevant anymore. There are plenty of better alternatives out there for FREE. Please do not waste your money.",
                "date": "2025-06-02",
                "value": 85,
                "potential_idea": "Implement simultaneous front and back card display for language learning and integrate automatic translation for new cards to match free competitor features.",
                "tags": [
                    "no update for long time",
                    "valuable opinion",
                    "bug"
                ]
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "It’s great for what it is, but highly unintuitive and doesn’t sync well with iOS.  I’ve used Anki on and off for a while now, and I get less and less impressed with it",
                "date": "2025-05-15",
                "value": 75,
                "potential_idea": "Develop a mobile flashcard app with an intuitive user interface and seamless iOS integration, inspired by Anki's core functionality.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "AnkiMobile Flashcards",
                "rating": 1,
                "review": "I assumed because this one had a paid version it would be superior. This requires you to be familiar with using the AnkiWeb desktop version and can then transfer your cards. But as a not computer savvy person found that to be a lot of work. I am already studying for a bunch of other classes. I had hoped this would be straightforward and user friendly. \n\nThe other FREE “AnkiApp” worked exactly as I had assumed this app should work. I could instantly start building cards and had access to those cards to study. It also looked “cleaner” or more modern which my artist tendencies prefer. Try before you buy. My mistake cost me.",
                "date": "2025-05-11",
                "value": 75,
                "potential_idea": "Develop a mobile-first Anki-style flashcard app with a streamlined card creation and study interface, directly comparable to 'AnkiApp' and obviating the need for desktop synchronization for basic users.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "916366645",
        "name": "Procreate Pocket",
        "url": "https://apps.apple.com/us/app/procreate-pocket/id916366645?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Procreate Pocket",
                "rating": 1,
                "review": "Whenever I make a new canvas I can’t draw beacuse it kicks me out of the app, I WILL NOT EVER DOWNLOAD THIS AGAIN this is the worst app ever",
                "date": "2025-09-28",
                "value": 15,
                "potential_idea": "Implement robust error handling and crash prevention to ensure app stability during canvas creation and drawing.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 1,
                "review": "I used to love this app, especially for logo making. But recently, when I add text to a canvas and tap to edit it, it crashes. There is no workaround and I even tried uninstalling and reinstalling to no avail. This has been ongoing for months now.",
                "date": "2025-09-26",
                "value": 15,
                "potential_idea": "Implement a robust text editing functionality that prevents crashes, potentially by isolating text element rendering or improving error handling within the text editing module.",
                "tags": [
                    "bug",
                    "no update for long time"
                ]
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 1,
                "review": "update is HORRIBLE",
                "date": "2025-09-23",
                "value": 5,
                "potential_idea": "Implement a 'rollback' feature allowing users to revert to a previous app version.",
                "tags": []
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 1,
                "review": "I’ve been using procreate since around the time it came out, and got pocket the moment it first became available- but this app, despite all I’ve invested in it, has become completely unusable. Even the normal version can’t be used for a minute before crashing. Very sad to see.",
                "date": "2025-09-08",
                "value": 35,
                "potential_idea": "Implement robust crash detection and reporting within the app to proactively identify and fix stability issues.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 2,
                "review": "There is no sonarpen support for this version.. Whenever i need to draw on phone sometimes I require a stylus right? (also the people that use fingers to draw i am not offended you.) but it has no support god.. i would like a refund..",
                "date": "2025-09-04",
                "value": {
                    "intensity": 15,
                    "difference": 10,
                    "scope": 10,
                    "feasibility": 15,
                    "total": 50
                },
                "potential_idea": "Implement stylus support, specifically for SonarPen, allowing for more precise drawing and interaction within the app.",
                "tags": [
                    "niche demand",
                    "bug"
                ]
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 1,
                "review": "For an app that costs money it has way too many technical and formatting issues. Certain things like the drawing guide dont work when you turn them on and the formatting and layout for the app is just awful.",
                "date": "2025-08-27",
                "value": 70,
                "potential_idea": "Implement robust user interface testing and bug fixing processes to ensure core features like drawing guides function as expected and improve overall app formatting and layout.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 1,
                "review": "I was unable to use. It’s extremely hard and frustrating. Might have better luck with a iPad. But I highly don’t recommend getting this app.",
                "date": "2025-08-22",
                "value": 15,
                "potential_idea": "Develop a user-friendly interface for the app that is optimized for mobile screen sizes, addressing the reported frustration with usability.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 2,
                "review": "The layers that don’t have a check on them keep showing up on the screen when I’m trying to share my layers. Please fix the bug",
                "date": "2025-08-09",
                "value": 60,
                "potential_idea": "Implement a 'share-only' mode that temporarily hides or disables layers not intended for sharing.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 1,
                "review": "They have an automatic selection tool that works in a straightforward, low-tech way (adjacent pixel contrast detection, more or less). That would be fine for my collage- and meme-making purposes HOWEVER you cannot paint directly onto a mask. \n\nYour options for modifying the mask directly are either A) use the built-in selection tools (with the underlying layer turned off, so you can see the mask clearly) or B) use brushes and black/white to modify it ONLY with the underlying layer turned on. There is no rendering the mask alone in its plain black-and-white form so you can see clearly if there are any spots you missed. \n\nIt's also unfortunate because you lose access to a lot of cool effects that are achievable by applying filters to masks. It's so vexing because you can see the underlying mask in its true black-and-white form in the thumbnail for the mask, there's just no working on it in full screen. So close but so far, very disappointing to omit this valuable feature.",
                "date": "2025-08-04",
                "value": 75,
                "potential_idea": "Implement a dedicated mask editing mode that allows users to view and directly paint on masks in their pure black-and-white form, independent of the underlying layer.",
                "tags": [
                    "valuable opinion",
                    "niche demand"
                ]
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 2,
                "review": "The lack of an undo button makes this app practically useless. Kind of a giant waste of money. 2 stars bc it can still be used like a dry erase board.",
                "date": "2025-07-15",
                "value": 80,
                "potential_idea": "Implement an undo/redo functionality to allow users to easily correct mistakes, enhancing the app's usability for creative and editing tasks.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 1,
                "review": "On a photos you can’t erase what you did and there’s no undo button and what the size is and it didn’t let me change the color so I don’t recommend this app and not worth the price.",
                "date": "2025-07-09",
                "value": 70,
                "potential_idea": "Implement an undo/redo functionality and enhance editing tools with color selection for photo adjustments.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 1,
                "review": "This is the worst app I’ve ever used don’t pay for it so complicated Jeff bezos couldn’t even understand it",
                "date": "2025-07-06",
                "value": 15,
                "potential_idea": "Simplify the app's user interface and onboarding process to make it intuitive for a wider audience.",
                "tags": []
            },
            {
                "app_name": "Procreate Pocket",
                "rating": 1,
                "review": "clicked something and it erased my whole drawing I tried looking for a undo button but I couldn’t find it anywhere",
                "date": "2025-07-06",
                "value": 85,
                "potential_idea": "Implement a prominent and easily accessible undo/redo button within the drawing interface to prevent accidental data loss.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "1477966166",
        "name": "MONOPOLY: The Board Game",
        "url": "https://apps.apple.com/us/app/monopoly-the-board-game/id1477966166?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "MONOPOLY: The Board Game",
                "rating": 1,
                "review": "Fix & update the game",
                "date": "2025-09-29",
                "value": 15,
                "potential_idea": "Develop a clear, in-app changelog and update notification system for mobile games to inform players about bug fixes and new features.",
                "tags": [
                    "no update for long time",
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "497716362",
        "name": "TonalEnergy Tuner & Metronome",
        "url": "https://apps.apple.com/us/app/tonalenergy-tuner-metronome/id497716362?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "TonalEnergy Tuner & Metronome",
                "rating": 1,
                "review": "Metronome sussy nogger",
                "date": "2025-08-18",
                "value": 5,
                "potential_idea": "Develop a metronome app with a highly unusual and attention-grabbing name or visual theme.",
                "tags": []
            },
            {
                "app_name": "TonalEnergy Tuner & Metronome",
                "rating": 1,
                "review": "Never had a problem before - but now metronome will not play and stays in microphone mode.",
                "date": "2025-03-28",
                "value": 15,
                "potential_idea": "A mode switch or toggle to manually exit microphone mode for the metronome feature.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "549105915",
        "name": "True Skate",
        "url": "https://apps.apple.com/us/app/true-skate/id549105915?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "True Skate",
                "rating": 1,
                "review": "I previously bought the Schoolyard for bolts, but am now unable to use it since you made every park available for purchase with bolts.",
                "date": "2025-09-17",
                "value": 75,
                "potential_idea": "Allow users to convert in-app currency ('bolts') back into real money or offer a refund option when game mechanics change.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 1,
                "review": "I used to play this game all the time you could easily play some different maps and the controls were easy. I came back to this game after a couple years and lost all my progress even though i have the same i cloud and everything and everything costs so much money there is no possible way I can purchase new board stuff or new maps without having to pay money out of pocket so saddening. This game is not worth it anymore",
                "date": "2025-08-23",
                "value": 55,
                "potential_idea": "Implement a cloud-based progress synchronization system that preserves player progress during account transitions and offers a progressive free tier for unlocking new maps or cosmetic items.",
                "tags": [
                    "bug",
                    "bug"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 1,
                "review": "Lost everything because the devs decided to remove the option to log in with apple account. I have spent so much money on this game and am extremely disappointed as to why they’d even do this.",
                "date": "2025-08-03",
                "value": 85,
                "potential_idea": "Reintroduce or offer alternative secure login methods like Google or email, and implement a robust data backup system to prevent users from losing progress and purchases.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 1,
                "review": "Horrible game u can’t even feeble grind to rail slide cause the angle they put u at",
                "date": "2025-08-02",
                "value": 70,
                "potential_idea": "Implement more forgiving physics for performing tricks like rail slides, allowing for a wider range of entry angles and slight imperfections in timing.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 1,
                "review": "ts be tweaking half of the time",
                "date": "2025-07-17",
                "value": 10,
                "potential_idea": "Implement a feature that allows users to fine-tune app settings for optimal performance and stability.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 2,
                "review": "Game is solid, fun game, but it will not let me restore in game purchases the only way for me to get my things back is if I buy them all again ☹️💔",
                "date": "2025-07-06",
                "value": 80,
                "potential_idea": "Implement a robust in-app purchase restoration feature that allows users to recover previously purchased items across devices or after reinstalling the app.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 1,
                "review": "U first make the game cost money then make every map cost money yea no dont get this game just literally get a better free skate game.",
                "date": "2025-06-16",
                "value": 60,
                "potential_idea": "Offer a portion of game content or maps for free to attract a wider user base before pushing for paid content.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 2,
                "review": "Tl;dr\n• Played for years, even back when achieving skate points was significantly harder\n• Maps I bought never refunded when they wouldn’t launch since 2022\n• Fast forward 2025 and the app won’t even launch.\n• The developers gave up on this game",
                "date": "2025-06-15",
                "value": 18,
                "potential_idea": "Implement a robust backend system that automatically verifies and refunds users for in-app purchases of content that becomes inaccessible due to technical issues or lack of app support.",
                "tags": [
                    "no update for long time",
                    "bug"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 1,
                "review": "focus a little more on actually getting the game to work please",
                "date": "2025-06-10",
                "value": 15,
                "potential_idea": "Improve the core stability and performance of the mobile game to reduce bugs and crashes.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 1,
                "review": "My purchases are gone you thieves",
                "date": "2025-06-03",
                "value": 100,
                "potential_idea": "Implement robust data backup and recovery for user purchase history to prevent data loss.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 1,
                "review": "this app won’t launch for me. also don’t buy any skateparks or anything the purchases don’t work for me on a new device",
                "date": "2025-05-13",
                "value": 15,
                "potential_idea": "Implement a seamless in-app purchase redemption system that transfers bought items to a new device upon login.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 2,
                "review": "First thing I wanna say is I really like the gameplay. I’ve probably had this game since mid 2010s and the fact that I still come back to it sometimes says a lot. \n\nHOWEVER, like many others have already said, there’s content I paid REAL MONEY for back in the day that I no longer have access to. Decks and grips I paid for back in the day are completely gone without a trace. A 3 pack of maps I bought show up but only 1 of the 3 will load. The others say “invalid lighting data”. It gives the instructions to delete the content and redownload but nothing works.\n\nThe fact that they are asking you to pay a subscription for all features of the game when they don’t even take care of the OGs who got them to where they are now is a disgrace. \n\nZERO BIG BOOMS ❌💪",
                "date": "2025-04-29",
                "value": 85,
                "potential_idea": "Implement a robust system for restoring previously purchased in-game content for longtime players, including a clear process for handling corrupted or inaccessible DLC like maps and cosmetic items.",
                "tags": [
                    "bug",
                    "no update for long time"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 2,
                "review": "Had this since about 2015-16. I have SLS 16 maps that are on my account on my iPod touch but for some reason not on on my phone(iPhone 15). I have many decks and grip tape bundles purchased with real money that are just gone. Support responds whenever they feel like it or they just don’t. Connecting accounts is painstakingly hard for no reason at all. Always a problem trying to get Facebook or Apple to connect. The gameplay and idea is there. However I’m afraid the developers are dull and money hungry. Stop pushing for buying all this paid content when it randomly disappears so there is no point. And stop adding new content and not fixing old bugs. “Missing Light Data” on a mobile game map? Seriously? Even small unity developers don’t throw errors like that. Fix it!",
                "date": "2025-04-21",
                "value": 15,
                "potential_idea": "Implement a robust account synchronization system that ensures in-app purchases and game progress are seamlessly transferable across devices and platforms.",
                "tags": [
                    "no update for long time",
                    "bug"
                ]
            },
            {
                "app_name": "True Skate",
                "rating": 1,
                "review": "Ight bru I was finna ignore this but it’s costs money to buy the game with ONE SKATEPARK. That alone is unacceptable btw, more skateparks are 5 DOLLARS. And bro. To unlock sandbox mode (just sandbox mode)\nIt is a MONTHLY SUBSCRIPTION NOTHING YOURE OFFERING IS WORTH ANY OF THAT. A MONTHLY SUBSCRIPTON IS CRAZY AND ABSURD",
                "date": "2025-04-17",
                "value": 85,
                "potential_idea": "Offer a one-time purchase option for additional skatepark content and unlock sandbox mode, or structure existing subscription content into a more attractive one-time purchase bundle.",
                "tags": []
            }
        ]
    },
    {
        "id": "1631859420",
        "name": "After Inc.",
        "url": "https://apps.apple.com/us/app/after-inc/id1631859420?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "After Inc.",
                "rating": 2,
                "review": "paid for game, but new missions behind DLC. lame",
                "date": "2025-09-30",
                "value": 18,
                "potential_idea": "Offer DLC content as tiered unlockable content within the base game's progression system to avoid user frustration with hidden costs.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "After Inc.",
                "rating": 2,
                "review": "Be aware before you start that to get the full game, you’ll need to buy this, then pay 5x as much to get the “DLCs.” I’m sorry, but DLCs aren’t bigger and more expensive than a base game. I get the strategy to milk a cash flow, but the creator has to expect bad reviews for yanking his customers around. \n\nIt’s a good game that I would have gladly paid more for the full game of, but the approach completely turned me off. You’re just buying a very bare-bones tutorial here.",
                "date": "2025-09-29",
                "value": 70,
                "potential_idea": "Offer a comprehensive 'complete edition' or 'premium version' of the game at an upfront price that includes all current and future DLCs.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "After Inc.",
                "rating": 2,
                "review": "Don’t like how the developers are coming for more and more cash in every new game released. But I do enjoy their games very much! You can’t even unlock the extra content by completing the game on brutal…",
                "date": "2025-09-25",
                "value": 55,
                "potential_idea": "Implement an in-game rewards system that allows players to unlock extra content through gameplay achievements rather than solely relying on in-app purchases.",
                "tags": [
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "6743115658",
        "name": "TABS Pocket Edition",
        "url": "https://apps.apple.com/us/app/tabs-pocket-edition/id6743115658?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "I can only use my Apple ID or whatever it’s called so I can’t play and now I’m sad because I don’t have it on any other devices",
                "date": "2025-09-26",
                "value": 75,
                "potential_idea": "Implement support for multiple login options, such as email/password or Google/Facebook accounts, to increase accessibility.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "A lot of people are facing this issue too best to wait until they fix it before you buy",
                "date": "2025-09-25",
                "value": 15,
                "potential_idea": "Implement a system to flag or clearly communicate known bugs preventing purchase or core functionality, potentially with a temporary 'unavailable' status or a clear message about the fix timeline.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "The game requires an account and internet to play what should be an offline game. This should be illegal.",
                "date": "2025-09-23",
                "value": 70,
                "potential_idea": "Implement an offline mode for the game that does not require an account or internet connection.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "Would not let me make an account",
                "date": "2025-09-17",
                "value": 15,
                "potential_idea": "Implement more robust account creation error handling and user feedback to guide users through the process.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 2,
                "review": "So, my friend plays this game on there pc, so, naturally, I wanted to get it when I found out that there was a pocket edition. However, my device doesn’t allow me to sign in on things, which makes me unable to play this game and I just wasted five dollars",
                "date": "2025-09-13",
                "value": 75,
                "potential_idea": "Implement an offline mode or a guest login for the mobile app to allow game access even without user account sign-in functionality.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 2,
                "review": "Hello. For some reason, I can’t sign in on my Apple account. Could you guys maybe add more ways to sign in? Like Google and other stuff..",
                "date": "2025-09-13",
                "value": 14,
                "potential_idea": "Integrate additional sign-in options like Google, email, or other popular social media platforms to improve accessibility and user choice.",
                "tags": [
                    "bug",
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "If you have a school Apple ID and can’t play then you just wasted 4.99, make a non sign in option please.",
                "date": "2025-09-12",
                "value": 17,
                "potential_idea": "Implement a guest or non-signing option for users who do not wish to link their Apple ID, especially for paid features, to accommodate users with restricted school accounts.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "Could you please add more ways to sign in like with email or google",
                "date": "2025-09-06",
                "value": 60,
                "potential_idea": "Implement alternative sign-in methods including email and Google accounts to improve user accessibility and convenience.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "My son can’t load the game without an apple account and it will not let him use his account.  There is no help option either.",
                "date": "2025-09-05",
                "value": 18,
                "potential_idea": "Implement an offline mode or a guest login for the game to allow users without Apple accounts to play.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "It didnt even let me sign in",
                "date": "2025-09-03",
                "value": 15,
                "potential_idea": "Implement a robust and user-friendly sign-in/sign-up system with clear error messaging and support options.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "The game even says ages 12+ and yet I can’t play it! Please add more sign in options for the game! A huge waste of money",
                "date": "2025-08-30",
                "value": 75,
                "potential_idea": "Implement a wider range of sign-in/account creation options to accommodate users without access to standard methods.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "game just forever loads and i dont even know why, im probably gonna refund if it isnt patched soon",
                "date": "2025-08-30",
                "value": 80,
                "potential_idea": "Implement robust background loading and error reporting for app performance issues to proactively address user frustration.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 2,
                "review": "I loved this game as a kid but when I got it on my phone  it said  Sign in with Apple so I press it  then a pop up said  your apple account cannot be used to  create a account  for other  apps so please help me or did I get scammed",
                "date": "2025-08-30",
                "value": 65,
                "potential_idea": "Implement an alternative account creation method beyond 'Sign in with Apple' to accommodate users whose Apple accounts are restricted from creating new app accounts.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "Every time I enter the game the game crashes and I also need to sign in and there’s no play as a guest button",
                "date": "2025-08-30",
                "value": 70,
                "potential_idea": "Implement a 'Play as Guest' option to allow users to try the game without immediate sign-in, alongside fixing critical crashing bugs.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "I’ve played this game before and I was so excited to play it on mobile but then it’s says it can’t sign me in. Landfall please add more ways to sign in",
                "date": "2025-08-26",
                "value": 75,
                "potential_idea": "Implement a 'forgot password' or account recovery feature for mobile sign-in.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "I can’t play it.",
                "date": "2025-08-20",
                "value": 15,
                "potential_idea": "Improve app launch speed and reliability to ensure users can access core functionality.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "Don’t waist your money, the app doesn’t work on IPADs or IPhones properly. You can’t even enter the game at this time.",
                "date": "2025-08-20",
                "value": 15,
                "potential_idea": "Enable the app to function correctly on iPads and iPhones, allowing users to enter and play the game.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "Can't advance past title screen. Can't sign in with apple option not because of age but because it dont work. Wish there was a guest option to log in with. Big fan of tabs, would really like to play this.\nEdit: After dl, it takes 2 launch attempts to reach title scene. timeouts on the 1st. the process is duplicative.",
                "date": "2025-08-19",
                "value": 80,
                "potential_idea": "Implement a guest login option that bypasses external authentication services and allows immediate access to the app, and improve initial app launch stability to prevent timeouts and duplicate launches.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "Can u please make it where you don’t neeed apple to sign in",
                "date": "2025-08-19",
                "value": 45,
                "potential_idea": "Allow users to sign up and log in using email/password or Google accounts in addition to (or instead of) Apple sign-in.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "Why do I have to sign into online services every time to play this game?? This blocks child accounts from playing and from playing offline. Terrible implementation.",
                "date": "2025-08-19",
                "value": 70,
                "potential_idea": "Implement offline mode for games that does not require recurring online service sign-ins, especially for child accounts.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "Please add more sign in options.",
                "date": "2025-08-18",
                "value": 15,
                "potential_idea": "Integrate social media login and anonymous guest access to simplify user onboarding and increase sign-up flexibility.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 1,
                "review": "i cant sign in with my apple account. add other ways",
                "date": "2025-08-16",
                "value": 65,
                "potential_idea": "Integrate OAuth login options beyond Apple, such as Google and Facebook, to provide users with alternative sign-in methods.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "TABS Pocket Edition",
                "rating": 2,
                "review": "Man I got this finally and then oh I gotta Sign in with Apple ok that’s fine but only Apple Is bad what I realized I’m under 13 so I can’t use my Apple please give Google or something else I don’t want Apple",
                "date": "2025-08-16",
                "value": 18,
                "potential_idea": "Offer alternative sign-in methods beyond 'Sign in with Apple', such as Google or email/password, to accommodate users under 13 or those without Apple devices.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "891194610",
        "name": "Earn to Die 2",
        "url": "https://apps.apple.com/us/app/earn-to-die-2/id891194610?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Earn to Die 2",
                "rating": 2,
                "review": "The only thing worse than P2W is P2W behind the guise of a quality game paid once. For shame.",
                "date": "2025-09-25",
                "value": 12,
                "potential_idea": "Introduce a tiered subscription model for the mobile game, offering exclusive cosmetic items and non-P2W gameplay advantages that do not impact core progression.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Earn to Die 2",
                "rating": 2,
                "review": "The first one is probably one of my favorite and most satisfying games to play. This has been since i was a little kid. In this game, progression takes way too long, they spam boxes everywhere, and there isn’t really many fun places to waste all of your boost like in the first one. The variety is definitely cool but after a while this game gets really boring and repetitive. The first one had way better pacing.",
                "date": "2025-08-26",
                "value": 65,
                "potential_idea": "Introduce a faster progression system or offer more engaging ways to use in-game boosts to combat boredom and repetitiveness, drawing inspiration from the pacing of the first game.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Earn to Die 2",
                "rating": 1,
                "review": "This game wouldn’t be worth downloading if it was free, let alone spending money on it. Very lazy and boring design, you play the same level over and over upgrading your car to get a few meters further each time until you are so bored of the level, then you beat it and have to start all over from scratch with a new car. Very repetitive and BORING",
                "date": "2025-08-24",
                "value": 15,
                "potential_idea": "Introduce a more dynamic progression system with varied level objectives and unlockable abilities to break the monotony of repetitive gameplay.",
                "tags": []
            },
            {
                "app_name": "Earn to Die 2",
                "rating": 1,
                "review": "No meaningful upgrades or sense of progression",
                "date": "2025-07-28",
                "value": 70,
                "potential_idea": "Implement a clear progression system or unlockable milestones to give users a sense of achievement and ongoing engagement in the app.",
                "tags": [
                    "no update for long time",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Earn to Die 2",
                "rating": 2,
                "review": "The game itself is alright but not as good as the first. The game progression takes double the time and whoever the level editor was put way to many boxes and obstacles in the levels. Like why are there so many I’ve gotten stuck on so many of the boxes and crates to where I burn more fuel trying to get over them and lose fuel to make it to the end.\n\nI’m sure that’s the point but it makes the levels harder then they need to be",
                "date": "2025-07-23",
                "value": 60,
                "potential_idea": "Introduce an 'easy mode' difficulty setting that reduces the number of obstacles and fuel consumption to streamline gameplay progression.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Earn to Die 2",
                "rating": 1,
                "review": "It’s a big pay to win game. Don’t waste your time",
                "date": "2025-03-20",
                "value": 15,
                "potential_idea": "Develop an app that transparently analyzes and rates mobile games based on their 'pay-to-win' elements, helping players avoid predatory monetization schemes.",
                "tags": []
            },
            {
                "app_name": "Earn to Die 2",
                "rating": 2,
                "review": "Bad game",
                "date": "2025-01-10",
                "value": 0,
                "potential_idea": "N/A",
                "tags": []
            },
            {
                "app_name": "Earn to Die 2",
                "rating": 1,
                "review": "Skip this game, it’s extremely repetitive and really not fun at all in my option. You’re stuck using the same stupid car the entire level, no option at all to upgrade to the next one. You also have to upgrade things in perfect sequence, it use to be you could pick the engine you want out, which would involve saving money for a good one. This one you have to upgrade the original engine and it takes 10X as long but doesn’t really improve each upgrade. 1 full run will give you MAYBE 1 bar of upgrades out of like 10. So 10 runs to upgrade one area of your vehicle. Which there is like 7. The first game was just dumb, easy, super fun, and simple. This one is over complicated to a whole new level when the first game was totally perfect.",
                "date": "2025-01-02",
                "value": 75,
                "potential_idea": "Introduce a more flexible and rewarding upgrade system allowing players to choose their upgrade path and offering meaningful progression after each upgrade. Alternatively, a 'classic mode' that mirrors the simpler mechanics of the first game could be considered.",
                "tags": [
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "1093131935",
        "name": "Incredibox",
        "url": "https://apps.apple.com/us/app/incredibox/id1093131935?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Incredibox",
                "rating": 1,
                "review": "The user interface is clunky, no way to actually make your own sounds. Everything is a canned noise that all you do is turn on or off. Maybe this is music making for today’s kids, but if you’re looking for truly creative music making, I recommend the Figure app by reasons.",
                "date": "2025-09-25",
                "value": 85,
                "potential_idea": "Introduce a custom sound design or sample import feature allowing users to create unique audio elements beyond pre-set loops and effects.",
                "tags": [
                    "valuable opinion",
                    "niche demand"
                ]
            }
        ]
    },
    {
        "id": "1491530147",
        "name": "Slay the Spire",
        "url": "https://apps.apple.com/us/app/slay-the-spire/id1491530147?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Slay the Spire",
                "rating": 2,
                "review": "Sadly I recommend against purchasing StS for iPhone.  The touch controls are highly unreliable.  I have fairly slender fingers and I’m dextrous, using iPhone 13 Pro Max, and even when being very careful selecting cards, I still miss fairly often.  The 2nd to left-most card is super difficult to select to discard.  Selecting a card to discard will often result in the wrong card being thrown away, regardless of how careful you are to touch it directly.  Also, after touching a card, it remains weirdly “sticky” — i.e. it often won’t go back into your hand, and you have to carefully click around your other cards, hoping to deselect it, lest it be played.  The issues are fairly constant; definitely recommend not spending $10 on this.  Just play on PC.",
                "date": "2025-09-12",
                "value": 15,
                "potential_idea": "Implement an adjustable 'tap target' size for cards to improve touch control accuracy on mobile devices.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Slay the Spire",
                "rating": 1,
                "review": "Terrible controls, unplayable.",
                "date": "2025-08-29",
                "value": 15,
                "potential_idea": "Implement customizable control schemes to allow users to remap buttons and adjust sensitivity for a more personalized and comfortable gameplay experience.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Slay the Spire",
                "rating": 2,
                "review": "I adore this game, have sunk a ridiculous amount of hours into it but wanted to come leave some feedback for the devs that the latest update has added a lot of frustration to my experience on iOS (iPhone XS if it matters). Cards in my hand have gotten super sticky - very often when I tap to select they don’t rise high enough up to be able to read the text and I’ll have to tap them up and down 3 or 4 times, often have to tap a different card and go back to it before it’ll pop up properly. \n\nI’m methodical enough that it hasn’t led to too many misplays, and I’m never too proud to scum save when it does…but it does make my turns take a lot longer and adds a lot of extra tapping and frustration. \n\nIt was running fine for years so I was surprised to see anything change this late into the game. So while on one hand I’m happy to see this game is still getting some dev love on mobile, on the other all it’s caused me is grief lol so hopefully they’re still up for some more tweaking! It’ll be an easy 5 stars with this one gripe fixed. Thanks!",
                "date": "2025-08-28",
                "value": 15,
                "potential_idea": "Implement a card selection refinement to ensure consistent and immediate card text visibility upon tapping.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Slay the Spire",
                "rating": 2,
                "review": "huge fan of slay the spire, but the low framerate in this version makes it really difficult to do precise card interactions and makes playing much more of a chore than it needs to be. even on the newest iphone 16s,\nframerate still lags, so seems like a developer update is badly needed.",
                "date": "2025-07-22",
                "value": 75,
                "potential_idea": "Optimize the mobile app for higher frame rates and smoother gameplay to improve precise card interactions and overall user experience.",
                "tags": [
                    "bug",
                    "no update for long time"
                ]
            },
            {
                "app_name": "Slay the Spire",
                "rating": 2,
                "review": "Have played this on PC & Android with no issues & loved it. Just got an IPhone & the experience is notably worse. Incredible game, just a bad experience on IOS.",
                "date": "2025-07-19",
                "value": 15,
                "potential_idea": "Optimize the mobile app's performance and user experience specifically for iOS devices to match or exceed the PC and Android experience.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Slay the Spire",
                "rating": 1,
                "review": "The writing size is too small.",
                "date": "2025-05-06",
                "value": 10,
                "potential_idea": "Allow users to adjust the text font size within the app to improve readability.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Slay the Spire",
                "rating": 1,
                "review": "Can't proceed because the finish turn button not working",
                "date": "2025-03-17",
                "value": 15,
                "potential_idea": "Implement robust error handling and user feedback mechanisms to clearly indicate when critical app functions, like the 'finish turn' button, are unresponsive, and provide alternative actions or clear error messages.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Slay the Spire",
                "rating": 2,
                "review": "I just found out that crucial cards are not being unlocked. This app is abandoned and broken.",
                "date": "2025-02-04",
                "value": 17,
                "potential_idea": "Implement robust background synchronization or real-time updates for crucial game progression elements to prevent data loss and unlocked content issues.",
                "tags": [
                    "bug",
                    "no update for long time"
                ]
            },
            {
                "app_name": "Slay the Spire",
                "rating": 2,
                "review": "I see why so many people swear by this game, but the number of times I’ve ‘accidentally’ played a card I didn’t intend to due to the faulty user interface is just inexcusable. I doubt this game will receive updates to fix any of its issues with the sequel just around the corner, so I’d recommend folks just wait for that.",
                "date": "2025-01-06",
                "value": 60,
                "potential_idea": "Implement a confirmation step before playing a card in the game to prevent accidental plays caused by UI issues.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "404990064",
        "name": "SkyView®",
        "url": "https://apps.apple.com/us/app/skyview/id404990064?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "SkyView®",
                "rating": 1,
                "review": "I’ve tried deleting and reinstalling several times. I’ve restarted my phone. I’ve played with the calibration. The app just refuses to work. I’ve had this app forever and it’s always been one of my favorites. My kids and I love finding the planets. Please fix this app so I can update my review!",
                "date": "2025-09-25",
                "value": 15,
                "potential_idea": "Develop an offline mode with cached astronomical data for stargazing apps to function without a reliable internet connection.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "SkyView®",
                "rating": 2,
                "review": "I really wanted to see where the JWST is floating in space but was disappointed to find that it is no yet integrated into the app. Other than that I enjoy anything space related and this app gives me the opportunity to see where the heavenly bodies are!",
                "date": "2025-08-28",
                "value": 70,
                "potential_idea": "Integrate real-time tracking of space missions, such as the James Webb Space Telescope, into the app.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "SkyView®",
                "rating": 2,
                "review": "I really like this app for its clear, uncluttered view of the night sky. Unfortunately, the real stars are rarely where SkyView says they are. Tonight, it showed the Big Dipper at due north. If someone knows how to accurately calibrate this app, please let me know. Waving it in a figure 8 doesn’t seem to work.",
                "date": "2025-07-30",
                "value": 65,
                "potential_idea": "Implement an advanced, guided calibration feature that utilizes device sensors and a quick sky alignment process to ensure accurate real-time sky mapping.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "SkyView®",
                "rating": 2,
                "review": "Love this app. But it’s not locating correctly on my phone. Help!",
                "date": "2025-04-27",
                "value": 18,
                "potential_idea": "Implement a robust location accuracy diagnostic tool within the app to help users troubleshoot and improve GPS performance.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "SkyView®",
                "rating": 1,
                "review": "I’ve paid for the upgraded version and it will not be in the correct orientation.",
                "date": "2025-03-05",
                "value": 15,
                "potential_idea": "Implement robust orientation locking and troubleshooting for users experiencing display issues in the upgraded version.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "SkyView®",
                "rating": 2,
                "review": "You used to label the planets. What happened? I paid to use the app. I am extremely disappointed.",
                "date": "2025-02-28",
                "value": {
                    "intensity": 20,
                    "difference": 15,
                    "scope": 15,
                    "feasibility": 15,
                    "total": 65
                },
                "potential_idea": "Reintroduce or enhance planet labeling features for astronomical observation apps, especially for paying users.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "SkyView®",
                "rating": 1,
                "review": "I bought this because it boasted that it could take augmented pictures of the sky. No matter what I do the camera stays shaded out.",
                "date": "2025-02-26",
                "value": 60,
                "potential_idea": "Implement a robust image processing pipeline for the augmented reality sky feature that handles varying lighting conditions and prevents camera shading.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "SkyView®",
                "rating": 1,
                "review": "Paid to upgrade and nothing appears like the screenshots. Literally the same as the basic, free version. Don’t waste your money. They won’t approve a refund.",
                "date": "2025-02-01",
                "value": 75,
                "potential_idea": "Implement a clear and transparent system for showcasing premium features to prevent user disappointment and enable seamless refunds for unmet expectations.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "SkyView®",
                "rating": 1,
                "review": "This app did not work. The app also says it will not refund the $2.99 I paid for it. Scam beware.",
                "date": "2025-02-01",
                "value": 15,
                "potential_idea": "Implement a clear and accessible refund policy and process within the app to address user concerns about refunds.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "SkyView®",
                "rating": 1,
                "review": "I tried both auto and manual calibration, neither of which was effective. But either way, it couldn’t find the moon, even when I had the camera view enabled and was pointing right at it. This used to be a more reliable app.",
                "date": "2025-02-01",
                "value": 15,
                "potential_idea": "Improve the moon-finding algorithm in the astrophotography app to restore its previous reliability.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "SkyView®",
                "rating": 1,
                "review": "Manually calibrating every time open app",
                "date": "2025-01-21",
                "value": 18,
                "potential_idea": "Implement automatic calibration upon app launch to save users time and frustration.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "SkyView®",
                "rating": 1,
                "review": "Was charged for this app I never wanted and being refused a refund which is insane .",
                "date": "2025-01-14",
                "value": 15,
                "potential_idea": "Implement a clear and easy-to-access option for users to cancel subscriptions or recurring charges directly within the app, along with a streamlined refund request process.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "912536422",
        "name": "Five Nights at Freddy's",
        "url": "https://apps.apple.com/us/app/five-nights-at-freddys/id912536422?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Five Nights at Freddy's",
                "rating": 1,
                "review": "It didn’t let me move. All I could do is turn to the left and right I couldn’t even look behind me",
                "date": "2025-08-21",
                "value": 75,
                "potential_idea": "Implement robust 360-degree camera control and free movement for a more immersive virtual experience.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Five Nights at Freddy's",
                "rating": 1,
                "review": "Do not like this game at all. The jump scares are not very good. You can’t move around I do not recommend it if you’re someone who likes to be scared and it cost money which I believe is a total scam and it’s not that fun.",
                "date": "2025-08-01",
                "value": 15,
                "potential_idea": "Develop a mobile horror game with dynamic and unpredictable jump scares, player agency in movement and exploration, and a free-to-play model with optional cosmetic purchases.",
                "tags": []
            }
        ]
    },
    {
        "id": "575154654",
        "name": "Pou",
        "url": "https://apps.apple.com/us/app/pou/id575154654?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Pou",
                "rating": 1,
                "review": "It took 3.23 cents off my card then a 1.99 . Why did it take a total of 5 dollars when it was only suppose to take 1.99 ?",
                "date": "2025-09-25",
                "value": 18,
                "potential_idea": "Implement a clear in-app breakdown of all charges and fees before a transaction is finalized to prevent surprise charges.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Pou",
                "rating": 2,
                "review": "I started playing Pou a while ago.But my complaints start at where everything is so expensive!! And I have to do level ups to unlock stuff but it’s sooooo hard to level up!!! I hate this game sometimes",
                "date": "2025-08-05",
                "value": 65,
                "potential_idea": "Implement a tiered in-game currency system or a 'starter pack' for new players to ease the initial progression and reduce the perceived expense in Pou.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "Pou",
                "rating": 1,
                "review": "If i payed for this app why am i getting adds ols let me know why i amm i will not tolerate it i  paid",
                "date": "2025-06-07",
                "value": 90,
                "potential_idea": "Implement a clear verification system for premium users to ensure no ads are displayed.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Pou",
                "rating": 1,
                "review": "there’s literally no sound at all",
                "date": "2025-05-24",
                "value": 10,
                "potential_idea": "Implement robust audio debugging tools for developers to quickly identify and fix sound issues within the app.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Pou",
                "rating": 1,
                "review": "I tried to play Pou with sis on my phone and my sis went on her iPad and we were so close that both of our pous were talking to each other we got so scared that I deleted this game and forgot I had to pay to play I have waisted all of my money now my broke",
                "date": "2025-04-19",
                "value": 12,
                "potential_idea": "Introduce a local multiplayer mode for Pou that allows two devices to play together wirelessly within close proximity, preventing accidental cross-talk and shared screen experiences.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Pou",
                "rating": 1,
                "review": "i bought this game with my first paycheck and this is horrible. i want a refund. why do i have to pay for money? i should have infinite money since i already payed once. not to mention it always crashes on me. and has ad?? like hello that’s so stupid. i want a refund. NOW!",
                "date": "2025-03-23",
                "value": 18,
                "potential_idea": "Implement a 'one-time purchase, all-inclusive' monetization model for casual games to eliminate in-app purchases and ads.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Pou",
                "rating": 1,
                "review": "POU IS A YIT YIT",
                "date": "2025-02-17",
                "value": 10,
                "potential_idea": "Develop an AI-powered sentiment analysis tool that can identify and interpret vague or nonsensical user inputs in mobile app reviews.",
                "tags": []
            },
            {
                "app_name": "Pou",
                "rating": 1,
                "review": "I really love this app but when you pay for an app you expect it to work. On my brothers page and mine Pou doesn’t gain energy when you put him to sleep like they used to. So now we’re stuck having to waste coins every time to increase energy.",
                "date": "2025-01-24",
                "value": 75,
                "potential_idea": "Ensure game mechanics like energy regeneration during sleep are functional for paid users, or offer compensation for lost functionality.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Pou",
                "rating": 1,
                "review": "This game have a camera a can locate you address!!! Be safe",
                "date": "2024-12-22",
                "value": 75,
                "potential_idea": "Implement a privacy feature that allows users to disable or mask location services for specific in-game actions or globally within the app.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Pou",
                "rating": 1,
                "review": "No funciona el micrófono",
                "date": "2024-12-19",
                "value": 10,
                "potential_idea": "Implement robust microphone testing and troubleshooting guides within the app to ensure proper functionality for all users.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Pou",
                "rating": 1,
                "review": "Charges your card fraudelently and does nothing to help you or refund you and is condescending. Do not download!",
                "date": "2024-10-28",
                "value": 17,
                "potential_idea": "Implement a robust and empathetic customer support system with clear refund policies and fraud detection alerts.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "640364616",
        "name": "Terraria",
        "url": "https://apps.apple.com/us/app/terraria/id640364616?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Terraria",
                "rating": 1,
                "review": "I can’t even load into this game when I click on the app. My screen goes pitch black",
                "date": "2025-09-27",
                "value": 10,
                "potential_idea": "Implement robust error handling and loading state indicators to prevent app crashes and inform users of issues.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Terraria",
                "rating": 1,
                "review": "The game has become completely unplayable on iPad with Magic Keyboard, might be a OS issue but super unfortunate. 5 star game, just leaving this hopping for an update.",
                "date": "2025-09-24",
                "value": 60,
                "potential_idea": "Implement game optimizations specifically for iPad with Magic Keyboard compatibility.",
                "tags": [
                    "bug",
                    "no update for long time"
                ]
            },
            {
                "app_name": "Terraria",
                "rating": 1,
                "review": "Game plays horrible compared to how it did 10 years ago. Mines the wrong blocks and places blocks in random places that you aren’t aiming for no reason and is just overall horrible compared to how it was. Why did you have to ruin it? Because this version is cheaper than the Xbox or pc version?",
                "date": "2025-09-23",
                "value": 75,
                "potential_idea": "Restore the mobile game to its original 10-year-old gameplay mechanics and control precision.",
                "tags": [
                    "no update for long time",
                    "bug"
                ]
            },
            {
                "app_name": "Terraria",
                "rating": 2,
                "review": "Why are the controls different! I don’t understand these new controls. I played like 10 years ago and I could just hold down the attack button and it would auto attack. I had an inventory on the bottom and now it’s a bag at the top. Not sure if there’s a way to layout it all out so it’s like the old controls but idk if I care enough to watch a yt vid to figure it out. I was hoping it’d be the same feeling",
                "date": "2025-09-21",
                "value": 70,
                "potential_idea": "Allow users to customize in-game controls and UI layout to match previous versions or personal preferences.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Terraria",
                "rating": 2,
                "review": "Its been 3 years since 1.4.5 was announced and literally nothing has happened. i quit dont get this game if you want to wait 10 years for the next update.",
                "date": "2025-09-13",
                "value": 15,
                "potential_idea": "Develop a mobile game with a transparent and consistent update schedule, clearly communicating development progress to players.",
                "tags": [
                    "no update for long time"
                ]
            },
            {
                "app_name": "Terraria",
                "rating": 1,
                "review": "The controls are so bad I could only play for about 30min. Probably a lot better on PC.",
                "date": "2025-08-21",
                "value": 55,
                "potential_idea": "Implement customizable touch controls for mobile users to improve gameplay experience.",
                "tags": []
            },
            {
                "app_name": "Terraria",
                "rating": 1,
                "review": "Super clunky experience for new players. maybe if better for experienced players. can’t imagine its great",
                "date": "2025-07-31",
                "value": 65,
                "potential_idea": "Develop an adaptive onboarding experience that tailors its complexity and guidance based on the user's prior experience with similar apps.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Terraria",
                "rating": 1,
                "review": "Was almost endgame and working on beating the moon lord with a master character but now all my progress is gone",
                "date": "2025-07-14",
                "value": 85,
                "potential_idea": "Implement robust cloud save functionality with automatic backups to prevent data loss in mobile games.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Terraria",
                "rating": 2,
                "review": "Самое неудобное управление на сенсоре эвер)",
                "date": "2025-07-13",
                "value": 10,
                "potential_idea": "Implement customizable gesture controls for in-app actions to improve user experience.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Terraria",
                "rating": 1,
                "review": "Terrible controls bring back old ones!",
                "date": "2025-07-13",
                "value": 15,
                "potential_idea": "Allow users to revert to a previous control scheme for the app.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "763692274",
        "name": "Grand Theft Auto: San Andreas",
        "url": "https://apps.apple.com/us/app/grand-theft-auto-san-andreas/id763692274?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Grand Theft Auto: San Andreas",
                "rating": 2,
                "review": "Al manejar tiende a irse a la derecha el volante\nYo juego con los botones tactiles, no es por una palanca vieja de control 🎮 pagué 7 dólares para que??? Para que al subirme a los carros y hacer las misiones solo tenga que estar corrigiendo el volante",
                "date": "2025-09-29",
                "value": 15,
                "potential_idea": "Implement an automatic steering assist feature for smoother in-game vehicle control, especially during missions.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Grand Theft Auto: San Andreas",
                "rating": 1,
                "review": "i love this game without a doubt in my mind but i dont appreciate buying it when i closed the app and opened it back up it wouldn’t load me in, it would keep closing the app entirely!",
                "date": "2025-09-29",
                "value": 15,
                "potential_idea": "Implement robust session management to prevent app crashes and ensure seamless reopening after closure.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Grand Theft Auto: San Andreas",
                "rating": 1,
                "review": "It has a glitch in it! \nOn spray Tags",
                "date": "2025-09-19",
                "value": 10,
                "potential_idea": "Implement a 'Spray Tags' bug reporting and resolution system to track and fix issues with this specific feature.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Grand Theft Auto: San Andreas",
                "rating": 1,
                "review": "اللعبه صارت تخرج لما ادخل فيها",
                "date": "2025-09-14",
                "value": 15,
                "potential_idea": "Implement robust crash reporting and error logging to proactively identify and fix game crashes.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Grand Theft Auto: San Andreas",
                "rating": 1,
                "review": "Tuve que borrar el proceso y comenzar desde cero, el juego está teniendo problema se congela mucho",
                "date": "2025-09-11",
                "value": 75,
                "potential_idea": "Implement real-time cloud saving and auto-backup for game progress to prevent data loss due to freezes or crashes.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "1164801111",
        "name": "AutoSleep Track Sleep on Watch",
        "url": "https://apps.apple.com/us/app/autosleep-track-sleep-on-watch/id1164801111?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "AutoSleep Track Sleep on Watch",
                "rating": 1,
                "review": "Alarms no longer work in ios26 and the developer has not addressed the issue.",
                "date": "2025-09-27",
                "value": 15,
                "potential_idea": "Implement a robust system for proactively monitoring and notifying users of critical bugs affecting core app functionality, such as alarms.",
                "tags": [
                    "no update for long time",
                    "bug"
                ]
            },
            {
                "app_name": "AutoSleep Track Sleep on Watch",
                "rating": 1,
                "review": "Even though I’ve unsubscribed it still charges for the subscription. Beware that you will not be able to cancel.",
                "date": "2025-09-27",
                "value": 95,
                "potential_idea": "Implement a clear and irrefutable in-app subscription cancellation confirmation flow with immediate effect, accompanied by a dedicated customer support channel for subscription-related disputes.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "AutoSleep Track Sleep on Watch",
                "rating": 1,
                "review": "Does not work since the latest update. Horrible timing since apple just buffed up the Health app and I’m just going to switch to the native Health app.",
                "date": "2025-09-25",
                "value": 10,
                "potential_idea": "Develop a robust and reliable app that deeply integrates with Apple Health, offering advanced features beyond native capabilities, ensuring seamless functionality after OS updates.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "AutoSleep Track Sleep on Watch",
                "rating": 1,
                "review": "Used to be my favorite app to track sleep, now it never works. Constantly gives an error with zero info. Delete app and redownload, it’ll work for a day. Then back to an error every day after that. Rinse and repeat. All the info shows up fine in the health app.",
                "date": "2025-09-23",
                "value": 10,
                "potential_idea": "Implement a more robust error handling and diagnostic system for the sleep tracking feature, providing clear error codes and troubleshooting steps to users.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "AutoSleep Track Sleep on Watch",
                "rating": 1,
                "review": "Why is this app no longer available on Apple Watches?",
                "date": "2025-09-22",
                "value": 75,
                "potential_idea": "Reintroduce the mobile app with full functionality on Apple Watches to cater to users who prefer smartwatch integration.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "AutoSleep Track Sleep on Watch",
                "rating": 1,
                "review": "After years of good syncing history, suddenly syncs about only 1/3 of days. iOS issue perhaps? Disturbing at best.",
                "date": "2025-09-21",
                "value": 55,
                "potential_idea": "Proactive sync health monitoring and smart troubleshooting for mobile apps.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "1581140954",
        "name": "Noir - Dark Mode for Safari",
        "url": "https://apps.apple.com/us/app/noir-dark-mode-for-safari/id1581140954?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Noir - Dark Mode for Safari",
                "rating": 1,
                "review": "When you enable this is says it can read and alter what’s plinth screens including passwords and cards",
                "date": "2025-09-30",
                "value": 0,
                "potential_idea": "Analysis failed.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Noir - Dark Mode for Safari",
                "rating": 1,
                "review": "Doesn’t work on in-app versions of Safari and the “contact us” section in the app doesn’t even bother to load an email address when it opens the email app. Waste of money.",
                "date": "2025-09-26",
                "value": 15,
                "potential_idea": "Implement robust in-app browser compatibility and ensure the 'contact us' feature reliably loads contact information.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Noir - Dark Mode for Safari",
                "rating": 1,
                "review": "担心数据安全问题，申请退款不通过，那就差评喽～",
                "date": "2025-09-09",
                "value": 50,
                "potential_idea": "Allow users to request app removal and receive a refund if they have security concerns.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Noir - Dark Mode for Safari",
                "rating": 2,
                "review": "Noir works flawlessly on Safari proper. Unfortunately, it doesn’t work when Safari is launched with an app. For example, clicking a link in an X post, Safari slides open, but no noir.",
                "date": "2025-07-02",
                "value": 65,
                "potential_idea": "Enable Noir's functionality to work within Safari views embedded within other applications.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Noir - Dark Mode for Safari",
                "rating": 1,
                "review": "I've had noir for years and just realized how good it really is!!",
                "date": "2025-06-13",
                "value": 5,
                "potential_idea": "Implement a 'discovery' feature that highlights underappreciated or advanced functionalities of the app to long-term users.",
                "tags": []
            },
            {
                "app_name": "Noir - Dark Mode for Safari",
                "rating": 2,
                "review": "Appreciate the dark mode but don’t trust the app. Understand it needs access to change darkness but it shouldn’t be asking for access to a password manager. Didn’t even visit that website. Was browsing the news when it asked. Very suspect. Feels like data mining/major invasion for a paid app. Deleting.",
                "date": "2025-04-11",
                "value": 95,
                "potential_idea": "Implement robust privacy controls and transparent permission requests, clearly explaining *why* specific access is needed, especially for paid applications.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Noir - Dark Mode for Safari",
                "rating": 2,
                "review": "Update 3/27/25: I really appreciate the devs responding and I also really really liked the app (as you can see from my crazy long review below), but I had to eventually un-install it a from my shortcuts a few days after DL.    \n\nWhen I had it installed (I have an iPhone 15 pro max, so not a old-ish iPhone btw. Also I use safari as my phone Internet browser) web pages would not load correctly. I would have to re-load the web pages pretty much all the time or sometimes re-loading wouldn’t work and everything on the page would just look wonky. I really wanted this to work because like I said in my review, I have light sensitivity & I prefer my phone to be on dark mode (I can read everything better and it doesn’t hurt my eyes so much) and some websites are now having options to be able to change to dark mode or will automatically change if that is your phones settings. But the majority don’t have that yet so their background will be white. I have “night shift” turned on for websites like that, but sometimes it’s not enough and still will hurt my eyes/give me a headache. \n\nAnyways, it just didn’t work for me. I had to un-install it because I was getting too frustrated with having to re-load sites, sites looking super weird and sites crashing all the time. I wasn’t really sure what was going wrong but I thought maybe it had something to do with the noir extension and as soon as I turned it off safari started working fine. \nBummed!\n———-\n\nJust purchased the app and I felt like I had to write a review to tell the devs thank you! I have really bad photophobia/light sensitivity, especially in the evening & at night, that causes super bad headaches and makes my eyes ache and hurt. I switch anything I can to dark mode, night shift etc. I even sometimes wear these goofy light sensitivity glasses (they block specific wavelengths of light). For a long time now I was so annoyed I couldn’t change all of safari on dark mode (a few websites I could but that’s it). I found this app randomly tonight and immediately bought and downloaded it. The instructions to install it on safari were very clear and I had it up and running in just a few minutes. The app also has other colors/themes you can choose besides just black which I thought was pretty cool if someone wants to change it to sepia instead or something. Also the app itself looks really nice and I thought for what it does I would have paid more than $3 for it so I appreciate the devs for keeping it at that price. Anyways, ty to the devs for making this!!",
                "date": "2025-03-29",
                "value": 85,
                "potential_idea": "Develop an independent progressive web app (PWA) that enforces a dark mode or customizable color filters for all web content, irrespective of the website's native support, addressing user light sensitivity across different browsers and devices.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Noir - Dark Mode for Safari",
                "rating": 1,
                "review": "Absolutely ridiculous I have to buy it once for my phone and s0end another $4 to have a Safari extension for my MacBook. I regret buying it.",
                "date": "2025-01-09",
                "value": 75,
                "potential_idea": "Offer a cross-platform license that unlocks the app for iOS, macOS, and potentially other Apple devices for a single purchase.",
                "tags": [
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "1400579543",
        "name": "imo video calls and chat HD",
        "url": "https://apps.apple.com/us/app/imo-video-calls-and-chat-hd/id1400579543?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Useless app, can’t add anyone . Emailed support , no response ! It’s a scam .",
                "date": "2025-09-30",
                "value": 15,
                "potential_idea": "Implement a reliable user onboarding and contact adding system with responsive customer support.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Now they are scamming even adds showing and country not changing",
                "date": "2025-09-29",
                "value": 60,
                "potential_idea": "Implement a robust geo-tracking and region selection feature that clearly displays the selected region and prevents unauthorized ad serving or content.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "There are tons on messenger app, why is this one limited to US and Canada numbers ?!?",
                "date": "2025-09-27",
                "value": 70,
                "potential_idea": "Expand the mobile app's messaging capabilities to support international phone numbers beyond the US and Canada.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Не стоит тратить денег",
                "date": "2025-09-27",
                "value": 5,
                "potential_idea": "Offer a free trial or a more transparent pricing model before users commit to purchasing.",
                "tags": []
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Keeps telling me my phone number is invalid, but my phone number is valid and real",
                "date": "2025-09-22",
                "value": 15,
                "potential_idea": "Implement a more robust phone number validation system that accounts for various international formats and common input errors.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "I can’t see international contacts",
                "date": "2025-09-20",
                "value": 60,
                "potential_idea": "Implement international contact support that automatically detects and displays contact information for users in different countries.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Everyone is using the free imo, but this paid version from the US can't connect with friends at all! You must change your Apple ID region to use it. This imo HD is fake!!",
                "date": "2025-09-18",
                "value": 10,
                "potential_idea": "Develop an international version of the mobile app that bypasses regional restrictions for user accounts and connections.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "This app is a waste of money.",
                "date": "2025-09-17",
                "value": 10,
                "potential_idea": "A premium version of the app that offers demonstrably unique and valuable features justifying the cost, or a clear refund policy for users who find the app lacking.",
                "tags": []
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "IMO keeps banning accounts unfairly for no valid reason, even when users are just having normal conversations with friends. This is extremely frustrating and unprofessional.\n\nWhat makes the situation worse is that there is no phone number or direct support email to contact them. Users are left with no way to solve their issues properly.\n\nI do not recommend this app until they fix these problems and provide real customer support.",
                "date": "2025-09-16",
                "value": 85,
                "potential_idea": "Implement a clear and accessible support system with a direct contact channel for users to appeal account bans and resolve issues.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Regret",
                "date": "2025-09-13",
                "value": 15,
                "potential_idea": "Implement an 'undo' or 'recover deleted item' feature for accidentally deleted content.",
                "tags": []
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Attention overseas users! \nThis US version cannot make international calls. You must change your account region to use the official version. YouTube has tutorials.",
                "date": "2025-09-11",
                "value": 15,
                "potential_idea": "Develop a multi-region version of the app that allows users to maintain their primary account region while accessing features and content relevant to other regions, without requiring account changes.",
                "tags": [
                    "niche demand",
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "This app does not allow to call any number outside United States. So save your money.",
                "date": "2025-09-09",
                "value": 15,
                "potential_idea": "Allow the app to make international calls to any number worldwide.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "It doesn’t see all contacts from my list. When I purchased the app it didn’t say my phone version supposed to be 9 or later. It doesn’t work for me. What should I do now?",
                "date": "2025-09-08",
                "value": 15,
                "potential_idea": "Implement a robust contact syncing mechanism that proactively informs users about potential compatibility issues with their device's OS version before purchase.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Paid for nothing! I wish I would read other reviews.",
                "date": "2025-09-08",
                "value": 18,
                "potential_idea": "Implement a free trial or a detailed demo to showcase app features and value before purchase, addressing user concerns about paying for an unproven product.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "This is a scam. I paid $5 for it, and I can’t talk to anyone outside US. Scam.",
                "date": "2025-09-07",
                "value": 75,
                "potential_idea": "Expand international calling/communication options for users outside the US to address geographic restrictions perceived as a scam.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Скачала потому что искала способы пообщаться с мамой. Я в Америке, она в России. Не получилось, потому что ссылки для приглашения не работают с 2х сторон и контактов не находит. Очень жаль",
                "date": "2025-09-06",
                "value": 15,
                "potential_idea": "Implement a more robust and reliable invitation system for connecting users across different regions, including direct contact syncing and troubleshooting for link issues.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "It says free but why does it ask for $4.99 to download the app or is it scam?",
                "date": "2025-09-06",
                "value": 15,
                "potential_idea": "Clarify app pricing and availability upfront to prevent user confusion and build trust.",
                "tags": []
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "this is useless app and please don't purchase it if you are looking to connect with your family nd friends outside US",
                "date": "2025-09-04",
                "value": 55,
                "potential_idea": "Develop a mobile app specifically designed for international communication, allowing users to easily connect with family and friends abroad, overcoming geographical barriers and potential network restrictions.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "I want to use this imo app, but it is expensive and costs $4.99. I have to change my Apple ID country and region to download another imo app. Now it works.\nJas",
                "date": "2025-09-03",
                "value": 18,
                "potential_idea": "Offer a subscription tier or a one-time purchase option for the IMO app that is accessible across all Apple ID regions, eliminating the need for users to change their region settings for purchase.",
                "tags": []
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Скачал приложение и заплатил около $5. Но зарегистрироваться не удалось,так как пишет что не верный номер.  Несколько раз пишу точнее номер , но ответа также  Результата ничего хорошего нет!!!",
                "date": "2025-08-31",
                "value": 15,
                "potential_idea": "Implement a robust phone number validation and verification system with clear error messages for registration.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Not working",
                "date": "2025-08-31",
                "value": 15,
                "potential_idea": "Implement robust error reporting and logging to quickly identify and fix app malfunctions.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "التطبيق معلق ع البلد امريكا. وانا من السعودية ورقمي سعودي. والتطبيق مثبت على علم امريكا ورمز الدوله. ورااافض يتغير معاي",
                "date": "2025-08-24",
                "value": 15,
                "potential_idea": "Allow users to manually select their country and country code, overriding any automatic detection, to resolve issues with incorrect country pre-selection.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "This paid version doesn't work at all! We need to switch the Apple ID region to another country to download the free official version",
                "date": "2025-08-19",
                "value": 18,
                "potential_idea": "Allow users to access the paid version of the app without region restrictions by verifying their subscription with an in-app purchase or account login, bypassing the need to change Apple ID region.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Ya cambié de ubicación pero no me dejan poner mi nuevo teléfono de mi nueva región",
                "date": "2025-08-08",
                "value": 90,
                "potential_idea": "Allow users to update their phone number and region information easily within the app to reflect new locations and contact details.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Yes, the official imo is free for international calls. If it's not showing up, changing your Apple ID region (guides on YouTube can help) usually solves it.",
                "date": "2025-08-06",
                "value": 70,
                "potential_idea": "Proactively guide users on how to resolve common regional restrictions for app features by providing in-app tutorials or troubleshooting links.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "If your App Store only shows paid versions, try changing your Apple ID's region to find and download the correct one.",
                "date": "2025-07-29",
                "value": 45,
                "potential_idea": "Develop a feature within the app that guides users on how to change their Apple ID region to access different app versions or content, offering in-app instructions and troubleshooting.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "2. Comment content: (Please don't keep this when commenting)\n\nTitle:  The free imo app exists! \n\nContent:  Yes, the official imo is free for international calls. If it's not showing up, changing your Apple ID region (guides on YouTube can help) usually solves it.",
                "date": "2025-07-28",
                "value": 15,
                "potential_idea": "Integrate a clear, in-app guide for users to understand and access the free international calling feature by adjusting region settings.",
                "tags": []
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "The official imo app is free. If you only see paid versions, you likely need to switch your App Store region to find the correct one.",
                "date": "2025-07-15",
                "value": 35,
                "potential_idea": "Implement a region detection and recommendation system within the app to guide users to the correct free version.",
                "tags": []
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "I can’t use as like WhatsApp",
                "date": "2025-07-13",
                "value": 75,
                "potential_idea": "Integrate a feature allowing users to send voice messages, similar to WhatsApp, within the current app.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 2,
                "review": "IMO had",
                "date": "2025-07-09",
                "value": 0,
                "potential_idea": "N/A",
                "tags": []
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "The US region setting on my Apple ID prevents this paid version from working. Change the country to download the free version.",
                "date": "2025-07-08",
                "value": 75,
                "potential_idea": "Allow users to select their preferred region for app functionality, independent of their Apple ID region setting.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Because my Apple ID is set to the US, this paid version doesn't work. \r\nI found a guide on YouTube on how to change the Apple ID region to use the free version",
                "date": "2025-07-03",
                "value": 15,
                "potential_idea": "Allow users to select their region during app setup to access relevant free or paid versions.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "Free imo works globally; this paid US version fails completely. Find YouTube guides on changing your Apple ID region to use the free version.",
                "date": "2025-06-29",
                "value": 85,
                "potential_idea": "Offer a global, unified version of the app that works seamlessly regardless of user region, eliminating the need for region-specific versions or workarounds.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "لا يعمل",
                "date": "2025-06-25",
                "value": 15,
                "potential_idea": "A robust error reporting system that allows users to easily submit detailed bug information.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "It only works if you have a number from us. I live in germany and I can not use my number to login! Say in your app that it is only for us users! You don’t even get 1 star!",
                "date": "2025-06-22",
                "value": 18,
                "potential_idea": "The app should clearly indicate its regional availability and allow users to select their country for account creation/login.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "imo video calls and chat HD",
                "rating": 1,
                "review": "My Apple ID defaults to the US region, making this paid version incompatible. To download the free version, you'll need to switch your Apple ID region to another country.",
                "date": "2025-06-19",
                "value": 75,
                "potential_idea": "Allow users to select their preferred region for app purchases and downloads within the app, bypassing Apple ID region restrictions.",
                "tags": [
                    "niche demand",
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "586149216",
        "name": "Monash FODMAP Diet",
        "url": "https://apps.apple.com/us/app/monash-fodmap-diet/id586149216?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "While at first this app may have been one of the few around, there are far better resources. Being able to utilize Googles AI allows you to quickly search for specific foods. \n\nSEARCH: horrible search. I often get nothing related to my search, even as simple as a banana gets mixed results. \n\nRECIPES: there are maybe 20 recipes. They all stem from white American cuisine. Also, it mixes a lot with being healthy. Having minimal recipes that do not display diverse flavors really cuts your results.",
                "date": "2025-09-30",
                "value": 55,
                "potential_idea": "Expand recipe library to include diverse global cuisines and offer customizable filters for dietary preferences (e.g., healthy, indulgent) beyond just 'healthy'.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "Doesn’t allow refunds? What a scam. This is supposed to be a database of foods with fodmap scores but they don’t have any foods that a normal person would eat, just a bunch of expensive foods that are already labeled as low fodmap. Good luck finding any items from a regular grocery store. I wasted $8 on a useless app when I have to Google the fodmap content of any foods i actually plan to eat.",
                "date": "2025-09-28",
                "value": 75,
                "potential_idea": "Expand the app's food database to include a wider range of common grocery store items and clearly label them with FODMAP scores, providing a valuable resource for users seeking affordable and accessible low-FODMAP options.",
                "tags": [
                    "niche demand",
                    "valuable opinion",
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "There are free app that give more details with regards to serving size and max serving size. It’s very surprising that Monash doesn’t do the same. Potatoes for example. My Dre app shows the percentage of each fod map it also says how many potatoes ( and size i.e medium potatoes) you can it and it still remain low fod map. MoNash on the other hand says 1/4 cup but up 500g. In my opinion it’s not informative enough and comes across as lazy.",
                "date": "2025-09-28",
                "value": 85,
                "potential_idea": "Enhance the Monash University FODMAP app with detailed quantitative serving size information, presenting multiple low-FODMAP serving options at varying portion sizes and their corresponding FODMAP percentages, similar to competing apps.",
                "tags": [
                    "valuable opinion",
                    "niche demand"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "This app is constantly contacting Facebook, Google, etc. just look at the privacy report.",
                "date": "2025-09-15",
                "value": 15,
                "potential_idea": "Provide users with a clear, real-time dashboard that visualizes all third-party data access by the app and offers granular controls to opt-out of specific data sharing.",
                "tags": {
                    "tags": [
                        "valuable opinion"
                    ]
                }
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "First of all, there’s no search option. Under the Food Guide, most of the suggested foods are not available in the U.S., at least not at my neighborhood Kroger. I’d love to have help from a dietitian, but I’m not paying out of pocket. I’ll ask my NP to refer me to a nutritionist in my area, one whom my Medicare will cover.",
                "date": "2025-09-05",
                "value": 70,
                "potential_idea": "Integrate a dietitian finder tool that filters by insurance coverage (like Medicare) and regional availability.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "a useless app that only promotes licensed products, offers little helpful information that isn’t easily accessible or complete and can be found elsewhere for free",
                "date": "2025-08-17",
                "value": 65,
                "potential_idea": "Develop an app that aggregates free, unbiased information, comparisons, and user reviews for a wide range of products and services.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "$8 most of it looks \"foreign\".  No oats/oatmeal? Hmm",
                "date": "2025-08-16",
                "value": 12,
                "potential_idea": "Add an option to filter or search for recipes that specifically include oats/oatmeal.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "I found this app very useful until the latest update. Not only are my previous reintroductions gone, but the text is cut off in the reintroductions window so you can only guess what food you are supposed to be reintroducing. The text is there but only IF you are using the smallest possible font on your phone. I'm an older adult and can't read small fonts anymore. ☹️  This update does not consider the accessibility of those with poor eyesight. It's very disappointing and honestly, not very professional either. It's sad to see this happen to what used to be such a good resource.",
                "date": "2025-08-14",
                "value": 75,
                "potential_idea": "Implement robust font scaling and layout adjustments that automatically adapt to various text sizes, ensuring all content is readable and accessible for users with visual impairments.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "I was hoping for a features similar to the Carb Manager App where you can scan and track the foods you are eating and then see the FODMAP score.  This app doesn’t have specific foods I am looking for and is hard to use if you are trying to discover which products in the store are or are not FODMAP.  I am disappointed that I purchased this app, even for only $8.",
                "date": "2025-08-08",
                "value": 75,
                "potential_idea": "Integrate a comprehensive food database with FODMAP scoring and a barcode scanner to enable effortless in-store product discovery and dietary tracking.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "Rather a waste of money if you are looking up foods. Many basic food are not included in the search which is what I expected. Not much for the USA. Nothing under oils for Lard, Tallow or other meat fats for example. Most brands are not USA brands so not recommended for use for the USA.  No contact for help with using the app is readily found. Very disappointing.",
                "date": "2025-07-14",
                "value": 75,
                "potential_idea": "Expand the app's food database with a focus on common American food items, traditional ingredients, and popular domestic brands, and improve the visibility of a customer support contact.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "With the latest update, I can no longer save a PDF of my report, nor can I email it to myself as a copy. What have you done? I have no idea where I can get some help so I decided to leave a bad review. Maybe somebody will see it and help. I use the iPhone version. I don’t understand why developers can’t leave well enough alone. I run into these problems all the time with software.",
                "date": "2025-07-08",
                "value": 15,
                "potential_idea": "Implement a clear and easily accessible in-app help or support section for users to find solutions to common issues and understand app functionality.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "I have made sure the app is in US mode.  I can’t foods that maybe canned vs. fresh/frozen. \n\nMissing USA titled foods or products. \n\nMost times not helpful because of this.",
                "date": "2025-06-23",
                "value": 15,
                "potential_idea": "Implement a feature to specifically identify and categorize 'canned' versus 'fresh/frozen' food options within the app, and improve the database to include more USA-titled foods.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "I’ve been using this app for my low FODMAP diet and am now using the diary for reintroduction of foods. Today I noticed all of my entries disappeared. Luckily I exported recently and only lost 2 days, so I did my best to reenter those. Just went on again and everything is gone again! I will need to track elsewhere because this can’t keep happening. Please fix this issue.",
                "date": "2025-06-03",
                "value": 95,
                "potential_idea": "Implement robust cloud backup and automatic synchronization for diet diary entries to prevent data loss.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "This would be great if you lived in Australia. I am USA based and there is so far only one product on the  list that I can purchase in the USA. I wanted to make sure everyone knows it’s USELESS. Don’t buy it if you are American.",
                "date": "2025-06-03",
                "value": 75,
                "potential_idea": "Geographically localized product listings that adapt to the user's region.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "If you are going to charge for an app at least try. This is no more than a list. They have a total of 8 breakfast recipes. Most include cheese or milk. One is just “jam” which is strawberries and sugar.",
                "date": "2025-05-27",
                "value": 15,
                "potential_idea": "Develop a recipe app with a wider and more diverse selection of recipes, including dairy-free and allergen-friendly options, to appeal to a broader user base.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "I installed the latest update and now all data from my diary is gone. I cannot recommend this app when it is built that poorly, and when the developers in charge don’t do any verification that the update they’re about to apply won’t break existing features. Bad software design.\nThe design changes to the app aren’t good either, the latest updates have been a downgrade in every way.",
                "date": "2025-05-06",
                "value": 18,
                "potential_idea": "Implement robust data backup and recovery mechanisms and conduct thorough pre-release testing to prevent data loss and ensure feature stability.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "Not nearly enough recipes, hard to navigate, and the recipes that they do have were still quite problematic. Definitely do not waste your money, a massive disappointment of an app",
                "date": "2025-05-04",
                "value": 75,
                "potential_idea": "Expand recipe library with a user-generated content feature for diverse and vetted recipes.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "I just updated the app and found that it erased ALL of my diary entries. I’ve been tracking for a long time so this is a big loss of data for me. I’ll no longer use this app for tracking as it’s no longer reliable and I’m very disappointed considering this is a paid app. Just wow…",
                "date": "2025-05-03",
                "value": 85,
                "potential_idea": "Implement robust automatic backup and cloud sync for diary entries to prevent data loss.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "What was the goal of changing the Diary add record / create report AND the save / cancel buttons? That change has reversed the positions of both functions, which means anyone who had been using the app and has muscle memory for making entries is now automatically touching the wrong buttons every single time they want to add to the diary. Was the point to frustrate existing users? Well, you’ve succeeded.",
                "date": "2025-05-03",
                "value": 55,
                "potential_idea": "Allow users to customize the placement of 'Add Record', 'Create Report', 'Save', and 'Cancel' buttons within the diary section to accommodate muscle memory and individual preferences.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "I have been diligently recording my diet and symptoms for 2 months. This morning, I decided to update the app and now ALL of that data is gone! So much work vanished in an instant.  Up until today, I would have given the app a 4 star rating. I have appreciated the food guide, recipes, and ease with which to track everything. It wasn’t perfect—but it was a great resource. However losing 2 months worth of valuable data is unpardonable.",
                "date": "2025-05-03",
                "value": 80,
                "potential_idea": "Implement robust cloud backup and restore functionality for user data to prevent catastrophic data loss during app updates.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "The changes make the app useless for me. Was able to see whole day’s activity and look at other days easily. Now having to scroll to see day’s data.  Boo.",
                "date": "2025-05-02",
                "value": 15,
                "potential_idea": "Revert the recent UI changes to restore easier daily and historical activity viewing, or offer a toggle for the old viewing experience.",
                "tags": [
                    "valuable opinion",
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "This app is great and makes it easy to track and find food. However, the new update is not good. The diary is too small and the reintroduction items are cut off and hard to use. The previous diary format was way better. Disappointed",
                "date": "2025-05-02",
                "value": 75,
                "potential_idea": "Revert the diary format to the previous version, or offer users a choice between the old and new diary layouts.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "The food list isn’t very well organized, the red/yellow/green lights aren’t in order, so it will show you the values randomly. Has really strange ranges too, for something like cornichons it will tell you 1.76oz is fine, then 17.07oz is in the yellow zone. I could see someone eating like 3oz of them, but who is eating almost a pound? Why not represent this in a more simplistic way. \n\nFinally, when you click “start the diet”, it just tells you what the diet is like, no more information than what you could find on Google, it doesn’t actually start anything for you. No calendar, nothing, you need to go find a dietitian to do it for you.",
                "date": "2025-04-27",
                "value": 75,
                "potential_idea": "Implement an intelligent food organization system with customizable and context-aware 'traffic light' health indicators and a guided 'diet start' feature that integrates with a calendar and suggests professional consultations.",
                "tags": [
                    "valuable opinion",
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "The food lists include packaged processed foods (from other countries despite using the country filter). It’s cumbersome to have to weed through all this just to try to find something like steel cut oats which are not listed.",
                "date": "2025-04-26",
                "value": {
                    "intensity": 18,
                    "difference": 15,
                    "scope": 20,
                    "feasibility": 15,
                    "total": 68
                },
                "potential_idea": "Implement a filtering option to exclude processed and international packaged foods within the app's food database.",
                "tags": [
                    "niche demand",
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "While looking through the list of all the low fodmap certified food, I have my country selected in the filter, yet I’m still seeing all the foods listed even if they are not in my country. Please fix!!!",
                "date": "2025-04-01",
                "value": 65,
                "potential_idea": "Implement a robust country-specific filtering mechanism for the low FODMAP certified food list that accurately displays only relevant products.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "Half the things I look up are not on here.",
                "date": "2025-03-26",
                "value": 15,
                "potential_idea": "Expand the app's content database to include a wider range of topics or items not currently covered.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "You know that I can’t get a refund from Apple, the way you set up the App doesn’t make it eligible. And I still canceled and deleted the app with in 3 hours. \nYou can keep the eight dollars or whatever. \nI hope this information is helpful to you, please DO NOT contact me if you have any other questions.\n\nBest regards  \nBS🤬",
                "date": "2025-03-15",
                "value": 15,
                "potential_idea": "Implement a clear and accessible in-app refund request system for users who are dissatisfied shortly after purchase.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "Just bought this app and right off the top, the first two categories of foods are “Low FODMAP Certified Foods” and “Low FODMAP Certified Meals” which are nothing more than a list of PROCESSED GARBAGE.” very disappointed. Total waste of money.",
                "date": "2025-02-28",
                "value": 16,
                "potential_idea": "Develop an app focused on providing educational content and recipes for natural, whole-food, low-FODMAP diets, distinguishing it from processed options.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "I can’t look up food while I’m grocery shopping. Anything I type I. It says it doesn’t exist. Very few recipes. I expected more from an app that costs $8.00. I wouldn’t purchase this. I’d like my money back. Not only is my gi tract irritated now.",
                "date": "2025-02-16",
                "value": 75,
                "potential_idea": "Integrate a robust food lookup and recipe search feature within the app to assist users during grocery shopping and meal planning, addressing the lack of relevant content.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "I bought this app because someone mentioned scanning products but I see no where to scan products. The app feels pretty generic and you can just google stuff instead.",
                "date": "2025-02-16",
                "value": 60,
                "potential_idea": "Integrate a product scanner feature that allows users to scan barcodes to quickly access product information or comparisons within the app.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 1,
                "review": "Not helpful.",
                "date": "2025-02-05",
                "value": 10,
                "potential_idea": "Provide clearer instructions and onboarding for new users to improve app understanding and utility.",
                "tags": []
            },
            {
                "app_name": "Monash FODMAP Diet",
                "rating": 2,
                "review": "The diary should be integrated with the food database to do personalised analysis of the effects and outcomes. The food database should be more sophisticated; i.e., deeper and broader in order to provide information about food and beverages available and consumed, and capable of gathering these data by UPC scans.",
                "date": "2025-01-18",
                "value": {
                    "intensity": 22,
                    "difference": 18,
                    "scope": 20,
                    "feasibility": 15,
                    "total": 75
                },
                "potential_idea": "Integrate a sophisticated food database with UPC scanning into the diary feature for personalized health outcome analysis.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "866450515",
        "name": "Forest: Focus for Productivity",
        "url": "https://apps.apple.com/us/app/forest-focus-for-productivity/id866450515?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Forest: Focus for Productivity",
                "rating": 2,
                "review": "That i spent money to buy the game but the items are still charged anh i can’t even fram these items",
                "date": "2025-09-28",
                "value": 70,
                "potential_idea": "Implement a system where purchased in-game items automatically become farmable or unlockable after a certain period or achievement, or offer a refund/credit for items that cannot be farmed.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Forest: Focus for Productivity",
                "rating": 2,
                "review": "After getting the new update my phone died while I had a tree growing.  After I charged my phone I tried to get back on the app and it logged me out of my account and I can’t log back in.  Now I’m trying to make a new account and the app won’t send me a confirmation email.  I’ve had the app for two months now and I was loving it up until now…",
                "date": "2025-09-26",
                "value": 15,
                "potential_idea": "Implement robust data persistence and offline saving capabilities to prevent data loss during unexpected app closures or device power loss.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Forest: Focus for Productivity",
                "rating": 1,
                "review": "I paid for this app so that I can easily use and navigate it from my apple watch without touching my phone!  If I have to use my phone to start tree planting and end it then what's the point?  Also no pausing option? no sycing option within other devices?  okay bye",
                "date": "2025-09-23",
                "value": 90,
                "potential_idea": "Implement a fully functional Apple Watch companion app for core actions like starting/ending tree planting, pausing, and syncing data without requiring phone interaction.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Forest: Focus for Productivity",
                "rating": 1,
                "review": "Too often during sessions it say “the host has removed you” and I get “kick out” the session and then once the session finished somehow I’m “back in” and I get the coins. This happens wayyy too often, this app has become so buggy during sessions, idk what happen to forest :\\",
                "date": "2025-09-22",
                "value": 45,
                "potential_idea": "Implement a robust session recovery and re-joining mechanism to prevent users from being unexpectedly removed from live sessions and ensure they receive earned rewards.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Forest: Focus for Productivity",
                "rating": 1,
                "review": "The app doesn’t pop up when I open apps I’ve blocked. I think you have a bug. I’ve tried uninstalling and installing.",
                "date": "2025-09-17",
                "value": 15,
                "potential_idea": "Implement a more robust background service or notification system to ensure blocked apps are consistently prevented from opening.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Forest: Focus for Productivity",
                "rating": 2,
                "review": "My forest stopped blocking apps, both on default and the allow list I created. I can still go on social media without any restrictions. I deleted the app and redownloaded, but I’m still having the same issue. Any way I can fix this?",
                "date": "2025-09-16",
                "value": 15,
                "potential_idea": "Implement a robust bug reporting and diagnostic tool within the app to help users and developers quickly identify and resolve functionality issues.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Forest: Focus for Productivity",
                "rating": 2,
                "review": "Been using this app on and off for years. No way to edit or manually adjust time. On to other options.",
                "date": "2025-09-16",
                "value": 60,
                "potential_idea": "Allow users to manually adjust or edit recorded time entries within the app.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Forest: Focus for Productivity",
                "rating": 2,
                "review": "I’ve used this app for years and it is cute, but it doesn’t function anymore. It used to block other apps being opened and the plant would die if you were on focus mode (a big motivator), but it doesn’t work anymore. I need a consequence for when I get out of focus mode.",
                "date": "2025-09-12",
                "value": 75,
                "potential_idea": "Reintroduce and enhance gamified focus blocking with visible consequences for breaking focus, like a decaying virtual plant.",
                "tags": [
                    "no update for long time",
                    "bug"
                ]
            },
            {
                "app_name": "Forest: Focus for Productivity",
                "rating": 2,
                "review": "Got the app earlier this summer and it’s awesome but just this morning I lost the majority of my progress after some app malfunctions. It’s showing that I’m essentially back at the first couple of days worth of use after unlocking a couple monthly challenges, had over 2K in coins saved with various trees/plants unlocked including several of the 2,000 coin. Bummer about losing the progress but looking forward to restarting a new garden I guess. Please add more achievements for those who’ve been playing for a while too.",
                "date": "2025-09-08",
                "value": 85,
                "potential_idea": "Implement robust cloud backup and synchronization for user progress to prevent data loss due to app malfunctions.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Forest: Focus for Productivity",
                "rating": 1,
                "review": "I love thee app, but I think it would be a great addition to have more orange, blue, and yellow flowers. The pink is getting boring. ***Edit. I paid for this app, and today, I was logged out for some unknown reason. All of my progress is gone. This is not ok. 😡😡😡. It still works on my iPad, but won't on my phone. I need it to work on my phone.  Is this because I said the pink is getting boring?  Please fix this or refund my money.",
                "date": "2025-09-05",
                "value": 80,
                "potential_idea": "Implement robust cloud-based syncing and backup for user progress to prevent data loss across devices.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "1303222868",
        "name": "Paprika Recipe Manager 3",
        "url": "https://apps.apple.com/us/app/paprika-recipe-manager-3/id1303222868?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Paprika Recipe Manager 3",
                "rating": 1,
                "review": "Can’t figure out how to use it a waste of money",
                "date": "2025-09-21",
                "value": 15,
                "potential_idea": "Improve onboarding and user guidance with interactive tutorials or guided walkthroughs.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Paprika Recipe Manager 3",
                "rating": 1,
                "review": "I don’t see using this. The User guide and help do not work nothing happens when trying to access them. I have to input so much data by hand I may as well use notes (free) and no known way to import existing data or what file format to use.",
                "date": "2025-09-18",
                "value": 75,
                "potential_idea": "Implement a data import feature that supports common file formats and provide clear guidance on file types for importing existing user data.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Paprika Recipe Manager 3",
                "rating": 1,
                "review": "I have vers 1 & 3 and three has stopped working and being told I have to but another license. I tried contacting support but no one has replied in over a month.",
                "date": "2025-09-14",
                "value": 60,
                "potential_idea": "Implement a unified license management system across app versions and improve customer support responsiveness for license inquiries.",
                "tags": [
                    "bug",
                    "no update for long time"
                ]
            },
            {
                "app_name": "Paprika Recipe Manager 3",
                "rating": 2,
                "review": "The app had the ability to pull a recipe from a photo. (Like recipe keeper). I downloaded it thinking it could. I wish I could have my $5 back.",
                "date": "2025-09-01",
                "value": 10,
                "potential_idea": "Develop a mobile app or feature that accurately extracts recipes from photos, addressing user frustration with existing inaccurate implementations.",
                "tags": [
                    "niche demand",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Paprika Recipe Manager 3",
                "rating": 1,
                "review": "The old version was discontinued and somehow made to crash instantly upon running it and I was forced to buy the new one despite V2 working fine before \nVile greedy anti consumer behavior",
                "date": "2025-08-31",
                "value": 12,
                "potential_idea": "Provide a clear migration path or update mechanism for users moving from older app versions to new ones, including clear communication about reasons for discontinuation and a way to transfer data or functionality.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Paprika Recipe Manager 3",
                "rating": 1,
                "review": "I did not approve any charges for this app, it is not in my active subscriptions, and yet it is charging me 4.99??",
                "date": "2025-08-24",
                "value": 15,
                "potential_idea": "Implement a clear and transparent in-app subscription management and cancellation portal directly within the app to prevent unauthorized charges.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Paprika Recipe Manager 3",
                "rating": 1,
                "review": "Recipe pages get stuck and unable to get to home browsing page even with typing in paprika home page.  Help button not working.  Giving up after about an hour. Requested delete app but not sure if this process provides  refund.",
                "date": "2025-08-18",
                "value": 10,
                "potential_idea": "Implement robust error handling and a more reliable navigation system to prevent users from getting stuck and ensure core app functionality remains accessible.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Paprika Recipe Manager 3",
                "rating": 1,
                "review": "I’ve been happy with this app for several years, all of a sudden the only thing I can get is a invalid certificate error. I can’t even contact support because of this",
                "date": "2025-08-05",
                "value": 18,
                "potential_idea": "Implement offline access or a fallback mechanism for accessing support channels when online connectivity is compromised or certificate errors prevent standard communication.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "1504952058",
        "name": "Papa's Sushiria To Go!",
        "url": "https://apps.apple.com/us/app/papas-sushiria-to-go/id1504952058?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Papa's Sushiria To Go!",
                "rating": 1,
                "review": "it’s a good game and but u can play it for free on some websites so please don’t pay for it since it gets boring after a little bit and you can just play it for free",
                "date": "2025-06-14",
                "value": 60,
                "potential_idea": "Develop a mobile app that offers curated, high-quality short-form gaming experiences with limited playtime to combat boredom and encourage discovery, similar to how some services offer free trials but with a focus on ongoing engagement through varied content.",
                "tags": []
            },
            {
                "app_name": "Papa's Sushiria To Go!",
                "rating": 1,
                "review": "Just started this game, and it locks up on the 3rd screen.  Very disappointed…",
                "date": "2025-06-08",
                "value": 15,
                "potential_idea": "Implement robust error handling and testing for critical game progression points to prevent in-game freezes.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Papa's Sushiria To Go!",
                "rating": 1,
                "review": "The game becomes unplayable the more you level up and the bubble tea is rigged because you lose points for it not being filled all the way and even afterwards when you buy the upgrade it does NOTHING",
                "date": "2025-03-21",
                "value": 65,
                "potential_idea": "Introduce a balanced difficulty scaling in the game that adjusts based on player level, ensuring fair progression and addressing player concerns about 'rigged' mechanics.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Papa's Sushiria To Go!",
                "rating": 2,
                "review": "This papas game is boring sadly",
                "date": "2024-10-26",
                "value": 5,
                "potential_idea": "Introduce mini-games or challenges within the papas game to increase engagement and variety.",
                "tags": []
            },
            {
                "app_name": "Papa's Sushiria To Go!",
                "rating": 1,
                "review": "I am VERY disappointed with these developers. Truly scammers. I saw that my daughter wanted this game and it was only $1.99. I was like sure whatever ill get it. After I bought it, it charged me $4.00!!! I am FURIOUS. Been stuck on customer service for an hour.",
                "date": "2024-08-15",
                "value": 18,
                "potential_idea": "Implement clear and transparent pricing, including a pre-purchase confirmation screen that explicitly states the final cost before authorizing payment.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Papa's Sushiria To Go!",
                "rating": 1,
                "review": "More stress inducing rather than relieving…other games were more starter friendly creating a joyous environment while this one, with its poorly created time management creates an environment of a rushed stress to get a decent finale score.",
                "date": "2024-06-23",
                "value": {
                    "intensity": 18,
                    "difference": 15,
                    "scope": 20,
                    "feasibility": 22,
                    "total": 75
                },
                "potential_idea": "Introduce a 'starter-friendly' or 'practice' mode with relaxed time constraints to ease new users into the game.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Papa's Sushiria To Go!",
                "rating": 1,
                "review": "The game said it was only $1.99 but it charged be $4.22 on my card. what a scam",
                "date": "2024-04-14",
                "value": 15,
                "potential_idea": "Implement a clear and transparent pricing display within the app, showing the exact final cost before purchase confirmation, including any regional taxes or unseen fees.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Papa's Sushiria To Go!",
                "rating": 1,
                "review": "How can you make a person's order when you can't see what they ordered after they order it? The \"order ticket\" shows two ingredients out of the six or seven or 10 or however many ingredients the person ordered. How are you supposed to use a list of two ingredients to cook an order that contains many more ingredients than that? And the ingredients shown are just icons – there's no indication of what they actually are. So if two or three ingredients you could choose from happen to look very much alike, which several do, you're just going to have to guess which of the look-alike items they wanted. Truly bizarre and unplayable game. I'm going to appeal to the App Store to give me my money back.",
                "date": "2024-02-26",
                "value": 85,
                "potential_idea": "Implement a detailed order display feature that shows all ordered ingredients with clear labels and descriptions, not just icons, to enable accurate order preparation.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Papa's Sushiria To Go!",
                "rating": 1,
                "review": "Why is there no permission details for the app?",
                "date": "2023-10-08",
                "value": 15,
                "potential_idea": "Provide users with clear and accessible permission details within the app for enhanced transparency.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Papa's Sushiria To Go!",
                "rating": 2,
                "review": "I really want to like this game and I enjoy it when it works, but every time I go to add ingredients to my sushi roll, the game freezes up",
                "date": "2023-08-02",
                "value": 15,
                "potential_idea": "Implement robust error handling and debugging tools to prevent game freezes during ingredient selection in the sushi-making game.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Papa's Sushiria To Go!",
                "rating": 1,
                "review": "The game is fun however they charged my card $1.99 when I never purchased anything or had a subscription with them.",
                "date": "2023-06-23",
                "value": 18,
                "potential_idea": "Implement a clear and transparent in-app purchase history and subscription management section to prevent accidental charges and provide users with control.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "837860959",
        "name": "Mini Metro",
        "url": "https://apps.apple.com/us/app/mini-metro/id837860959?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Mini Metro",
                "rating": 1,
                "review": "This is not an accurate representation of public transportation policy, design, construction, or management.",
                "date": "2025-08-10",
                "value": 15,
                "potential_idea": "Develop a mobile app that provides accurate, real-time information and analysis on public transportation policies, design, construction, and management.",
                "tags": []
            },
            {
                "app_name": "Mini Metro",
                "rating": 2,
                "review": "Ayo ima lil train boi ‘n I fuken luv dis!",
                "date": "2025-07-22",
                "value": 12,
                "potential_idea": "Develop a gamified learning app specifically for train enthusiasts to learn about different train types, history, and routes.",
                "tags": []
            },
            {
                "app_name": "Mini Metro",
                "rating": 1,
                "review": "An insanely simple component of any subway line is turning, which you cannot do in this game. Curved river in the way that you could easily navigate around? Nope too bad you need to use a tunnel. Oh hit wait - another stop opened up where you wanted to place the curve. *Now* you can curve the track. \n\nIncredibly stupid.",
                "date": "2025-07-09",
                "value": 70,
                "potential_idea": "Implement the ability for players to create curved tracks in the subway simulation game, allowing for more organic and realistic city layouts.",
                "tags": [
                    "valuable opinion",
                    "bug"
                ]
            },
            {
                "app_name": "Mini Metro",
                "rating": 1,
                "review": "Waist of money should be free for what is giving",
                "date": "2025-03-19",
                "value": 15,
                "potential_idea": "Offer a free tier with basic functionality to attract more users before encouraging premium upgrades.",
                "tags": []
            },
            {
                "app_name": "Mini Metro",
                "rating": 2,
                "review": "I thought they were. I thought there was bullet train.",
                "date": "2024-12-15",
                "value": 15,
                "potential_idea": "Integrate real-time public transit information, including bullet train schedules and routes, directly within the app to help users plan their journeys.",
                "tags": []
            },
            {
                "app_name": "Mini Metro",
                "rating": 1,
                "review": "There’s a tutorial and instructions but neither one really explains what the point of the game is. I think you’re supposed to move passengers between stations but there’s no real strategy involved. They give you multiple lines but you only need one line. Set it in a loop to all stations and then sit and stare at your screen for hours while trains slooooowly move around, I guess. I just don’t get what the point or the challenge is. It’s a beautiful looking game though.",
                "date": "2024-11-28",
                "value": {
                    "intensity": 18,
                    "difference": 15,
                    "scope": 17,
                    "feasibility": 12,
                    "total": 62
                },
                "potential_idea": "Introduce strategic gameplay elements, such as optimizing routes for efficiency, managing passenger demand with dynamic pricing, or incorporating random events that require quick decision-making to enhance the challenge and engagement of the train simulation game.",
                "tags": [
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "449735650",
        "name": "Where's My Water?",
        "url": "https://apps.apple.com/us/app/wheres-my-water/id449735650?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Where's My Water?",
                "rating": 1,
                "review": "disney is against free speech. taking my money elsewhere",
                "date": "2025-09-18",
                "value": 15,
                "potential_idea": "A streaming service that guarantees freedom of speech and content diversity, allowing users to monetize their own content.",
                "tags": []
            },
            {
                "app_name": "Where's My Water?",
                "rating": 1,
                "review": "dont buy",
                "date": "2025-07-18",
                "value": 10,
                "potential_idea": "An app that proactively warns users about potential scams or fraudulent mobile applications.",
                "tags": []
            },
            {
                "app_name": "Where's My Water?",
                "rating": 1,
                "review": "I have a player in the world, but I read download it, and it kept lagging and then crashing",
                "date": "2025-06-29",
                "value": 18,
                "potential_idea": "Implement robust error handling and performance optimization to prevent lagging and crashing, especially during app downloads or initial loading.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Where's My Water?",
                "rating": 1,
                "review": "When you open the game it automatically Crashes and takes you to the home screen, this game needs a patch fix.",
                "date": "2025-05-24",
                "value": 15,
                "potential_idea": "Implement robust crash detection and reporting mechanisms to identify and fix game stability issues.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "563718995",
        "name": "Bloons TD 5",
        "url": "https://apps.apple.com/us/app/bloons-td-5/id563718995?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Bloons TD 5",
                "rating": 1,
                "review": "Should have used the money for an ice cream",
                "date": "2025-08-16",
                "value": 10,
                "potential_idea": "Integrate a 'treat yourself' or reward system within the app that suggests small, enjoyable activities or purchases the user can make with saved money or points.",
                "tags": []
            },
            {
                "app_name": "Bloons TD 5",
                "rating": 2,
                "review": "this game is awesome but the co op is not working at all got in to one game with my friend and tried like 100 times  and didn’t work please fix this",
                "date": "2025-08-09",
                "value": 15,
                "potential_idea": "Enable stable and reliable co-op gameplay functionality for multiplayer sessions.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Bloons TD 5",
                "rating": 1,
                "review": "Latest update wont let me play with friends co op",
                "date": "2025-06-17",
                "value": 15,
                "potential_idea": "Implement a robust matchmaking system for co-op multiplayer that prevents players from being blocked from joining games after updates.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Bloons TD 5",
                "rating": 1,
                "review": "Only thing I like is the shredder should’ve brought that onto btd 6 but the difference in difficulty is too much",
                "date": "2025-06-07",
                "value": 15,
                "potential_idea": "Implement a difficulty scaling or tutorial mode for new users transitioning from simpler games like 'shredder' to more complex strategy games like Bloons TD 6.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Bloons TD 5",
                "rating": 1,
                "review": "My rank disappeared out of nowhere and I had so much unlocked I’m literally so mad all that money and hard earned achievements just gone I could seriously scream",
                "date": "2025-03-29",
                "value": 95,
                "potential_idea": "Implement a robust data backup and restore system to prevent loss of user progress, achievements, and in-app purchases.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Bloons TD 5",
                "rating": 1,
                "review": "Terrible game terrible mechanics and the game WILL NOT let you progress without spending money. Wish I could give 0 stars.",
                "date": "2025-03-29",
                "value": 80,
                "potential_idea": "Implement a clear free-to-play progression path or an alternative monetization model that doesn't gate core gameplay.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Bloons TD 5",
                "rating": 1,
                "review": "Just another microtransaction ripoff machine",
                "date": "2025-01-09",
                "value": 10,
                "potential_idea": "Implement a transparent and ethical in-app purchase system that clearly outlines the value of each transaction and avoids exploitative monetization strategies.",
                "tags": []
            },
            {
                "app_name": "Bloons TD 5",
                "rating": 1,
                "review": "This game was removed from my phone and when I redownloaded the game all my data was deleted and did not save in the cloud. Terrible waste of time",
                "date": "2024-12-28",
                "value": 85,
                "potential_idea": "Implement robust cloud save functionality that reliably syncs game progress across sessions and re-downloads.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "6508165149",
        "name": "Dungeon Clawler",
        "url": "https://apps.apple.com/us/app/dungeon-clawler/id6508165149?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Dungeon Clawler",
                "rating": 1,
                "review": "Just launched the game and all my progress is gone. Not starting over from scratch. Going to request a refund.",
                "date": "2025-09-16",
                "value": 70,
                "potential_idea": "Implement robust cloud-based progress saving and synchronization features for mobile games.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Dungeon Clawler",
                "rating": 2,
                "review": "I can’t get enough of this game, taking my love for claw games and making it into a dungeon crawler has me hooked!  Endless gameplay, lots of options lots of different paths worth the five dollars and more.  Considering how much I’ve spent on claw games in the past this game feeds that addiction. Feeds my gaming addiction, it keeps me coming back for more.   This game is amazing. People should spend the five dollars for it. I’m looking forward to more content so I’m spreading the word.",
                "date": "2025-09-15",
                "value": 80,
                "potential_idea": "Introduce new game modes or expansions that introduce more diverse dungeon crawling mechanics or a different take on the claw machine mini-game.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Dungeon Clawler",
                "rating": 2,
                "review": "The title says it all. My first complaint is the game takes far too long to show variance in runs making it feel stale fast.\nSecond, the game is far too RNG dependent, the mechanic to increase chances of receiving certain synergistic items doesn’t seem to be effective, you have practically no good choices even with heavy RNG manipulation and dozens of re rolls. Back to Peglin I guess 🤷‍♀️",
                "date": "2025-07-29",
                "value": 70,
                "potential_idea": "Implement a system that allows players to more reliably influence or mitigate RNG to ensure more diverse and engaging runs, addressing the feeling of staleness and frustration.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Dungeon Clawler",
                "rating": 1,
                "review": "I continued to play this game even with my issues below. I finished a run and probably started a few other ones. It's been idk how many days that I have not even thought about this game at all. On one of my runs I watch the claw go down and grab a bunch of items and right when it started to come up one of the items I was going for immediately disappeared. When it's the games mechanic I can't get past it. I will never play this game again and wasted the money I spent on it. I hate free to play but this game makes me want to just play free to play so I am not wasting money like this. I am very disappointed. I like this game. It's pretty entertaining. I just bought it today and I am on my first run. I am on floor 16 and just started to notice stuff disappearing. So 2 turns I watched the magnet drop in the machine and immediately disappear. Third turn it drops lands on the other stuff and when I went to grab it, it disappeared. Next stage same floor I watched stuff fall and immediately disappear. The reason such a low rating is grabbing stuff is the whole point of the game. Can't grab stuff if it doesn't drop or show up like it should. Please fix.",
                "date": "2025-02-07",
                "value": 75,
                "potential_idea": "Implement a visual confirmation or replay of item disappearances during gameplay to address user frustration and build trust in the game mechanics.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Dungeon Clawler",
                "rating": 2,
                "review": "This game requires precision in aligning the claw exactly over the objects you need to collect yet it makes it very difficult to do so.  If you try to drag the claw a millimeter it goes a centimeter and sometimes nowhere at all.  Maybe that’s by design but it creates a bad experience.  The player needs a left and right arrow he can tap to move the claw in finer increments.  Not going to play this game as it is right now unless these features are added",
                "date": "2024-11-29",
                "value": 85,
                "potential_idea": "Implement fine-tuned directional arrow controls for precise claw movement in a mobile game.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            }
        ]
    },
    {
        "id": "6738784092",
        "name": "A Little to the Left: Drawers",
        "url": "https://apps.apple.com/us/app/a-little-to-the-left-drawers/id6738784092?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "A Little to the Left: Drawers",
                "rating": 1,
                "review": "They need to update the app with more games frequently. There’s no reason I can complete the game the same day I buy it.",
                "date": "2025-09-23",
                "value": 65,
                "potential_idea": "Implement a system for regularly releasing new game content or challenges within the app to extend user engagement.",
                "tags": [
                    "no update for long time",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "A Little to the Left: Drawers",
                "rating": 1,
                "review": "This happened on level 2. You cannot place the items without them leaning in a certain direction. Also, it is impossible to know where to put them without using hints.",
                "date": "2025-06-28",
                "value": 60,
                "potential_idea": "Implement a visual guide or ghosting feature to show players the correct placement and orientation of items within levels.",
                "tags": [
                    "bug",
                    "valuable opinion"
                ]
            },
            {
                "app_name": "A Little to the Left: Drawers",
                "rating": 1,
                "review": "Paid 3 bucks just to finish the game in two hours. Not worth the money .",
                "date": "2025-06-05",
                "value": 15,
                "potential_idea": "Offer a free-to-play option with optional in-app purchases for faster progression or content unlocks to better align with player expectations.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "A Little to the Left: Drawers",
                "rating": 2,
                "review": "Theres only a few levels and it ends fairly quickly. I finished it with in a day and now if I want to continue playing I have to download the other app and pay $5.99. Just get the other app at that point and save money if you really want to play.",
                "date": "2025-06-03",
                "value": 65,
                "potential_idea": "Integrate or offer a discounted upgrade path from the initial free/lite app to the full paid app to avoid user frustration and potential churn.",
                "tags": [
                    "niche demand"
                ]
            },
            {
                "app_name": "A Little to the Left: Drawers",
                "rating": 1,
                "review": "Y’all charged me $1.99 for a game that was completely finished in 20 minutes???? Nah, what rip off. Get a cup of coffee with the $2 you saved by NOT PAYING for this game",
                "date": "2025-05-06",
                "value": 65,
                "potential_idea": "Offer games with significantly longer playtime or implement a demo/trial version to prevent user dissatisfaction with short-lived paid games.",
                "tags": []
            },
            {
                "app_name": "A Little to the Left: Drawers",
                "rating": 2,
                "review": "Fun game, but why did i pay $3 for there to be like 20 levels.",
                "date": "2025-04-04",
                "value": 55,
                "potential_idea": "Offer a free tier with limited levels to attract more users and a premium tier or in-app purchases for more content.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "A Little to the Left: Drawers",
                "rating": 2,
                "review": "32 total levels, and a handful of them are just busy work/filler levels (i.e. tapping the cat to pet it, then finish). I wouldn’t say this app is worth the $3 to purchase.",
                "date": "2025-03-28",
                "value": 35,
                "potential_idea": "Introduce a 'skip filler' or 'skip easy' option for players who want to progress through less engaging levels more quickly.",
                "tags": []
            }
        ]
    },
    {
        "id": "1392608717",
        "name": "Papa's Scooperia To Go!",
        "url": "https://apps.apple.com/us/app/papas-scooperia-to-go/id1392608717?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "Papa's Scooperia To Go!",
                "rating": 1,
                "review": "The controls are terrible",
                "date": "2025-05-23",
                "value": 45,
                "potential_idea": "Implement customizable and more intuitive in-app controls for improved user experience.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Papa's Scooperia To Go!",
                "rating": 1,
                "review": "The game seems fun but when I tried playing on my iPad the game is minimized because it doesn’t fit my screen.",
                "date": "2024-09-24",
                "value": 65,
                "potential_idea": "Implement adaptive UI scaling for different screen sizes to ensure optimal gameplay on various devices.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "Papa's Scooperia To Go!",
                "rating": 2,
                "review": "This one is boring and difficult. I love playing these games but OMG the build station is what catches me off guard. All I get is 98% on the build even though it looked perfectly done well. Pastaria is the same way (but I don’t mind that one cause it’s more fun than this one.) I mean I don't mind getting 98% on build in these games but this one is strict about it, like you have to have it perfect perfect in order to get a 100%. But honestly, I deleted this game mainly because it’s super boring, not the grading. I don’t really mind getting high scores not 100% in these games but what I’m saying is this is how strict the building is in this game. I deleted it because it was boring not really my taste (I have all the other ones though that are much rather entertaining and easier.) 🙃🤔",
                "date": "2024-05-18",
                "value": 15,
                "potential_idea": "Implement a forgiving 'perfect build' mechanic with a visual guide or progressive feedback to reduce player frustration and improve accessibility in simulation/tycoon games.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Papa's Scooperia To Go!",
                "rating": 1,
                "review": "This is the worst game that I ever played so thanks a lot enjoy my stupid money flip line",
                "date": "2024-03-29",
                "value": 15,
                "potential_idea": "Offer a clear 'refund' or 'cancel subscription' option within the app for dissatisfied users.",
                "tags": []
            },
            {
                "app_name": "Papa's Scooperia To Go!",
                "rating": 1,
                "review": "I accidentally bought this game. I WANT A REFUND!! 💯",
                "date": "2023-06-14",
                "value": 15,
                "potential_idea": "Implement an in-app purchase confirmation step with a delay or a secondary confirmation to prevent accidental purchases.",
                "tags": [
                    "valuable opinion"
                ]
            },
            {
                "app_name": "Papa's Scooperia To Go!",
                "rating": 1,
                "review": "ITS TOO SMALL FOR MY APPLE TABLET, It doesn’t fit the screen. The other to go papa game fits my screen but not scooperia.",
                "date": "2022-06-11",
                "value": 15,
                "potential_idea": "Implement adaptive UI scaling for larger tablet screens in Scooperia to ensure proper interface fit.",
                "tags": [
                    "bug"
                ]
            }
        ]
    },
    {
        "id": "405835358",
        "name": "MilGPS",
        "url": "https://apps.apple.com/us/app/milgps/id405835358?uo=2",
        "description": "",
        "reviews": [
            {
                "app_name": "MilGPS",
                "rating": 1,
                "review": "Love this app. Been using it for years. BUT it no longer lets me plot points and make overlays, which is a critical function. No customer service to contact either.",
                "date": "2025-04-27",
                "value": 90,
                "potential_idea": "Reimplement the plotting and overlay functionality for users, and provide accessible customer support.",
                "tags": [
                    "bug",
                    "no update for long time"
                ]
            },
            {
                "app_name": "MilGPS",
                "rating": 1,
                "review": "Won’t run on iPad",
                "date": "2025-02-17",
                "value": 15,
                "potential_idea": "Develop a dedicated iPad version of the app with optimized UI for larger screens.",
                "tags": [
                    "bug"
                ]
            },
            {
                "app_name": "MilGPS",
                "rating": 2,
                "review": "Does not pin point",
                "date": "2025-01-14",
                "value": 15,
                "potential_idea": "Implement location pinning functionality to allow users to mark and save specific locations within the app.",
                "tags": [
                    "bug"
                ]
            }
        ]
    }
]