[
    {
        "app_name": "Minecraft",
        "rating": 1,
        "review": "Bro, all the updates that you did are so good expect for the texture of the pig cow and chicken. The creaking is one of my favorites and the copper golem is so good. I really want a update already. It’s so much better more experiment and more fun Minecraft please I have more updates and mob to the game. I’m begging you. Minecraft I’m begging you please you’re my favorite game. You’re even better than Roblox.",
        "tags": [
            "untagged"
        ]
    },
    {
        "app_name": "Minecraft",
        "rating": 2,
        "review": "I played this game since I was like 8 but now it’s kinda boring and even if it is fun(it’s only fun when you play with friends) there’s only like a week long phase for when you play",
        "tags": [
            "valuable opinion"
        ]
    },
    {
        "app_name": "Minecraft",
        "rating": 1,
        "review": "I hate this game. I hate this game. How do we beat it? I hate this game. What do you even do there? I have to use creative mode all the time.\nStupid stupid stupid game",
        "tags": [
            "valuable opinion"
        ]
    },
    {
        "app_name": "Minecraft",
        "rating": 2,
        "review": "Why does a realm cost money? Because of this I can’t play with my sis",
        "tags": [
            "no update",
            "niche demand",
            "valuable opinion"
        ]
    },
    {
        "app_name": "Minecraft",
        "rating": 1,
        "review": "No",
        "tags": [
            "no update",
            "niche demand",
            "valuable opinion"
        ]
    },
    {
        "app_name": "Minecraft",
        "rating": 1,
        "review": "Whatever ya’ll did after this last update, it ruined the game. Starting the app is too slow to run, and freezes mid-game play. I got killed by mobs too many times because the app keeps freezing. I have Minecraft on Nintendo Switch and I have no issues with it compared to Pocket Edition!",
        "tags": [
            "valuable opinion"
        ]
    },
    {
        "app_name": "Minecraft",
        "rating": 1,
        "review": "Won’t even work stupid game is trash and wasted our money",
        "tags": [
            "no update",
            "niche demand",
            "valuable opinion"
        ]
    },
    {
        "app_name": "Minecraft",
        "rating": 2,
        "review": "So like when I was playing with my cousin and i left it just lag I am like erm what I had to re download it and it finally worked but it did it again",
        "tags": [
            "valuable opinion"
        ]
    },
    {
        "app_name": "Minecraft",
        "rating": 1,
        "review": "Minecraft mineCRAP",
        "tags": [
            "untagged"
        ]
    },
    {
        "app_name": "Minecraft",
        "rating": 1,
        "review": "I was playing a server than bam it kicked me out and restarted all my progress and also add in’s in this game tried to flirt with me and I’m a minor",
        "tags": [
            "valuable opinion"
        ]
    },
    {
        "app_name": "Minecraft",
        "rating": 1,
        "review": "This game is too scary!!!! I thouhh this game happy land but dis baby game is M FOR MATURE LISTEN. ok so i was playing.. saw thsi did and saw HEROBRIEN!!!!!! Anwya he mad me die🎅🫣",
        "tags": [
            "no update",
            "niche demand",
            "valuable opinion"
        ]
    }
]